{"P0001\n": ""}
{"P0002\n": ""}
{"P0003\n": ""}
{"P0004\n": ""}
{"P0005\n": ""}
{"P0006\n": ""}
{"P0007\n": ""}
{"P0008\n": ""}
{"P0009\n": ""}
{"P0010\n": ""}
{"P0011\n": ""}
{"P0012\n": ""}
{"P0013\n": ""}
{"P0014\n": ""}
{"P0015\n": ""}
{"P0016\n": ""}
{"P0017\n": ""}
{"P0018\n": ""}
{"P0019\n": ""}
{"P0020\n": ""}
{"P0021\n": ""}
{"P0022\n": ""}
{"P0023\n": ""}
{"P0024\n": ""}
{"P0025\n": ""}
{"P0026\n": ""}
{"P0027\n": ""}
{"P0028\n": ""}
{"P0029\n": ""}
{"P0030\n": ""}
{"P0031\n": ""}
{"P0032\n": ""}
{"P0033\n": "\nA good starting point is always to check for technical service bulletins (TSB) for your particular vehicle. Your issue may be a known issue with a known fix put out by the manufacturer and can save you time and money during diagnosis.\nFactory turbocharger boost pressure usually ranges between nine and fourteen pounds but check manufacturer’s specifications for your vehicle. Test boost pressure to make sure that it is sufficient. If boost pressure is low, internal turbocharger repair or turbocharger replacement may be necessary. Also check turbo hoses and exhaust components for leakage.\nThere are two basic designs of turbo boost control valves. In the first design, the valve is actuated using engine vacuum. An electronically controlled vacuum control valve provides vacuum to open the boost control valve, which is closed after vacuum is restricted. Typically, the vacuum control valve (or solenoid) is supplied with battery voltage and the PCM (or boost controller) provides a ground signal when applicable. In this type of system, engine vacuum must be checked prior to testing system electrical circuitry, components, and connectors. You may quick check the boost control valve using a hand-held vacuum pump. Simply apply vacuum directly to the valve and check operation.\nThe other turbo boost pressure control valve design utilizes an electronic valve. The valve receives a voltage signal from the PCM (or boost controller) when applicable. The voltage signal causes the valve to open and close proportionally as required to maintain optimum boost pressure. \n\nProfessional technicians report that the boost control valve is often condemned in error, when the boost pressure sensor is the defective part\n Using a digital volt/ohmmeter, test system circuit voltage and continuity to ensure that it is within manufacturer’s specifications. A system wiring diagram or manufacturer’s service manual (with diagnostic flow charts) will be required\nDisconnect system components and controllers prior to testing circuit continuity to prevent damage\n\n"}
{"P0034\n": "\nA good starting point is always to check for technical service bulletins (TSB) for your particular vehicle. Your issue may be a known issue with a known fix put out by the manufacturer and can save you time and money during diagnosis.\nMost turbocharger boost controllers are programmed to effect between nine and fourteen-pounds of boost pressure. The boost pressure bypass control valve is opened and closed (via an electrical signal from the PCM) as much as is required to maintain an acceptable degree of turbocharger boost pressure.\nWhen attempting a diagnosis for this code, I begin with a thorough inspection of all wiring and vacuum hoses related to the turbocharger and boost control system. \nI would proceed by reading and recording all trouble codes, then clearing the codes from the system. This serves two purposes; if the code fails to reset, you know that it is intermittent and, if your vehicle places the boost pressure bypass valve in the wide-open position when this type of code is stored, it will allow the system to return to a normal operating mode prior to further testing. \n\n Be sure to disconnect system components and controllers prior to testing circuit continuity (with a DVOM) to prevent damage\n I have had several experiences in which the boost control valve was condemned in error, when the boost pressure sensor was actually the defective part\nI normally use a digital volt/ohmmeter (DVOM) to test system circuit voltage and continuity to ensure that it is within manufacturer’s specifications. A system wiring diagram or manufacturer’s service manual (with diagnostic flow charts) will be necessary\n\n"}
{"P0035\n": "\nA good starting point is always to check for technical service bulletins (TSB) for your particular vehicle. Your issue may be a known issue with a known fix put out by the manufacturer and can save you time and money during diagnosis.\nSomewhere between nine and fourteen-pounds of boost pressure is typically the figure that most turbocharger boost controllers are programmed to effect. In order to maintain an acceptable degree of turbocharger boost pressure, the boost pressure bypass control valve is opened and closed to a calculated degree (via an electrical signal from the PCM).\nI generally start with an inspection of all wiring and vacuum hoses related to the turbocharger and boost control system when attempting to diagnosis this code. \nYou may continue with reading and recording all stored trouble codes and snap-shot data, then clearing the codes from the system. If the code fails to reset, then you know that it is intermittent. Some vehicles place the boost pressure bypass valve in the wide-open position when this type of code is stored; clearing the stored codes will also allow the system to return to a normal operating mode before you begin physical testing. \n\n System controllers and components may be damaged if you fail to disconnect them from system circuitry prior to testing continuity with a digital volt/ohmmeter (DVOM)\n Frequently, the boost control valve is condemned in error when the boost pressure sensor is actually the defective part \n Exhaustive testing for individual system circuits and components will prevent misdiagnosis that may lead to unnecessary component replacement \n To ensure that that system circuit voltage and continuity are within manufacturer’s specifications, I normally use a (DVOM) for testing. A system wiring diagram or manufacturer’s service manual (with diagnostic flow charts) will be indispensable\n\n"}
{"P0036\n": ""}
{"P0037\n": ""}
{"P0038\n": ""}
{"P0039\n": "\nA good starting point is always to check for technical service bulletins (TSB) for your particular vehicle. Your issue may be a known issue with a known fix put out by the manufacturer and can save you time and money during diagnosis.\nPursuant to maintaining an acceptable degree of turbo/supercharger boost pressure, the boost pressure bypass control valve is designed to open and close to a calculated degree (via an electrical signal from the PCM). The desired position of the valve is one which will afford maximum engine performance and efficiency, while avoiding potentially harmful (to the engine) boost levels.\nWhen diagnosing a P0039 turbo/supercharger bypass valve control circuit range/performance code, I would likely begin with an inspection of all wiring and vacuum hoses related to the turbo/supercharger and boost control system. I would also include an inspection of the battery, battery cables, and battery cable ends. \nProceed by retrieving and making note of all stored trouble codes and freeze-frame data (if available). Clear all stored diagnostic trouble codes from the system using a code reader or scanner. You may determine that the code is intermittent if it fails to reset. Intermittent codes can be even more difficult to diagnose. When this type of code is stored, some OBD-II systems will put the boost pressure bypass valve in the wide-open position. By clearing the stored codes, you will allow the boost pressure bypass valve system to return to a normal mode before you continue testing. \n\n A scanner (or code reader), digital volt/ohmmeter (DVOM), and a system wiring diagram or manufacturer’s service manual (with diagnostic flow charts) will prove necessary as well\n Take care to disconnect system controllers and components from the circuit prior to testing resistance/continuity with a DVOM \n The boost control valve is often condemned in error when the boost pressure sensor is actually faulty \n To prevent misdiagnosis, which could cause unnecessary replacement of parts, perform exhaustive testing of individual circuits and components related to this code \n I utilize a (DVOM) for testing. This will allow you to determine if system circuit voltage and resistance levels are within manufacturer’s specifications. \n\n"}
{"P0040\n": ""}
{"P0041\n": ""}
{"P0042\n": ""}
{"P0043\n": ""}
{"P0044\n": ""}
{"P0045\n": "\nBegin by visually inspecting the turbo and turbo control system. Look for loose connections, damaged wiring, vacuum leaks etc. Next, check for technical service bulletins (TSBs) regarding the issue. If nothing is found, you will need to move forward to step by step diagnosis of the system.\nThe following is a generalized procedure, as testing for this code varies between vehicles. To accurately test the system, you'll want referred to the manufacturer's diagnostic flow chart. \nCheck system function by commanding the control solenoid to change position using a bidirectional scan tool. Raise the engine RPMS to about 1,200 RPMs and toggle the solenoid between on and off. While doing this, engine RPMs should change and the sensor position PID on the scan tool should change as well. If the RPMs fluctuates but the position/pressure PID does not change, suspect a problem with the sensor or its circuit. If RPMS do not change at all, suspect a problem with the control solenoid, turbo/supercharger or wiring.\n\n To check the circuit: test for power and ground at the solenoid. Note: the solenoid should be commanded on with a scan tool while making these checks. If either power or ground are lacking, you'll need to trace the factory wiring diagram to determine why.\nCheck the turbocharger/supercharger: remove the intake to check the turbo/supercharger for damage or debris. If damage is found, replace the unit.\nTest the position/pressure sensor and circuit: in most cases, the position sensor should have three wires going to it: power, ground and signal. Test that all three are present.\nTest the control solenoid: in some cases, you may be able to test the solenoid by checking its' internal resistance with an ohmmeter. Consult the factory repair information for details. You may also be able to jump the solenoid to power and ground to see if it is operational. \n\n"}
{"P0046\n": "\nBegin by visually inspecting the turbo and turbo control system. Look for loose connections, damaged wiring, vacuum leaks etc. Next, check for technical service bulletins (TSBs) regarding the issue. If nothing is found, you will need to move forward to step by step diagnosis of the system.\nThe following is a generalized procedure, as testing for this code varies between vehicles. To accurately test the system, you'll want referred to the manufacturer's diagnostic flow chart. \nCheck system function by commanding the control solenoid to change position using a bidirectional scan tool. Raise the engine RPMS to about 1,200 RPMs and toggle the solenoid between on and off. While doing this, engine RPMs should change and the sensor position PID on the scan tool should change as well. If the RPMs fluctuates but the position/pressure PID does not change, suspect a problem with the sensor or its circuit. If RPMS do not change at all, suspect a problem with the control solenoid, turbo/supercharger or wiring.\n\n To check the circuit: test for power and ground at the solenoid. Note: the solenoid should be commanded on with a scan tool while making these checks. If either power or ground are lacking, you'll need to trace the factory wiring diagram to determine why.\nCheck the turbocharger/supercharger: remove the intake to check the turbo/supercharger for damage or debris. If damage is found, replace the unit.\nTest the position/pressure sensor and circuit: in most cases, the position sensor should have three wires going to it: power, ground and signal. Test that all three are present.\nTest the control solenoid: in some cases, you may be able to test the solenoid by checking its' internal resistance with an ohmmeter. Consult the factory repair information for details. You may also be able to jump the solenoid to power and ground to see if it is operational. \n\n"}
{"P0047\n": "\nBegin by visually inspecting the turbo and turbo control system. Look for loose connections, damaged wiring, vacuum leaks etc. Next, check for technical service bulletins (TSBs) regarding the issue. If nothing is found, you will need to move forward to step by step diagnosis of the system.\nThe following is a generalized procedure, as testing for this code varies between vehicles. To accurately test the system, you'll want referred to the manufacturer's diagnostic flow chart. \nCheck system function by commanding the control solenoid to change position using a bidirectional scan tool. Raise the engine RPMS to about 1,200 RPMs and toggle the solenoid between on and off. While doing this, engine RPMs should change and the sensor position PID on the scan tool should change as well. If the RPMs fluctuates but the position/pressure PID does not change, suspect a problem with the sensor or its circuit. If RPMS do not change at all, suspect a problem with the control solenoid, turbo/supercharger or wiring.\n\n To check the circuit: test for power and ground at the solenoid. Note: the solenoid should be commanded on with a scan tool while making these checks. If either power or ground are lacking, you'll need to trace the factory wiring diagram to determine why.\nCheck the turbocharger/supercharger: remove the intake to check the turbo/supercharger for damage or debris. If damage is found, replace the unit.\nTest the position/pressure sensor and circuit: in most cases, the position sensor should have three wires going to it: power, ground and signal. Test that all three are present.\nTest the control solenoid: in some cases, you may be able to test the solenoid by checking its' internal resistance with an ohmmeter. Consult the factory repair information for details. You may also be able to jump the solenoid to power and ground to see if it is operational. \n\n"}
{"P0048\n": "\nBegin by visually inspecting the turbo and turbo control system. Look for loose connections, damaged wiring, vacuum leaks etc. Next, check for technical service bulletins (TSBs) regarding the issue. If nothing is found, you will need to move forward to step by step diagnosis of the system.\nThe following is a generalized procedure, as testing for this code varies between vehicles. To accurately test the system, you'll want referred to the manufacturer's diagnostic flow chart. \nCheck system function by commanding the control solenoid to change position using a bidirectional scan tool. Raise the engine RPMS to about 1,200 RPMs and toggle the solenoid between on and off. While doing this, engine RPMs should change and the sensor position PID on the scan tool should change as well. If the RPMs fluctuates but the position/pressure PID does not change, suspect a problem with the sensor or its circuit. If RPMS do not change at all, suspect a problem with the control solenoid, turbo/supercharger or wiring.\n\n To check the circuit: test for power and ground at the solenoid. Note: the solenoid should be commanded on with a scan tool while making these checks. If either power or ground are lacking, you'll need to trace the factory wiring diagram to determine why.\nCheck the turbocharger/supercharger: remove the intake to check the turbo/supercharger for damage or debris. If damage is found, replace the unit.\nTest the position/pressure sensor and circuit: in most cases, the position sensor should have three wires going to it: power, ground and signal. Test that all three are present.\nTest the control solenoid: in some cases, you may be able to test the solenoid by checking its' internal resistance with an ohmmeter. Consult the factory repair information for details. You may also be able to jump the solenoid to power and ground to see if it is operational. \n\n"}
{"P0049\n": "\nA good starting point is always to check for technical service bulletins (TSB) for your particular vehicle. Your issue may be a known issue with a known fix put out by the manufacturer and can save you time and money during diagnosis.\nA diagnostic scanner, a digital volt/ohmmeter (DVOM), a reliable vehicle information source (like All Data DIY), and a manual boost pressure gauge will be necessary to diagnose a code P0049.\nI like to begin with a thorough inspection of all wiring, turbocharger supply hoses, and vacuum hoses related to the turbocharger and boost control system, when attempting to diagnose a P0049.\nNext, I’d continue by connecting the scanner to the vehicle diagnostic connector and retrieving all stored trouble codes. Writing the codes (and pertinent freeze frame data) down may prove helpful later in your diagnosis. After that, clear the codes and test drive the vehicle (if possible) and see if the code is reset. Should the code immediately reset, execute a manual boost pressure test and compare actual findings with manufacturer’s specifications. If actual boost pressure exceeds maximum requirements, suspect a problem in the bypass control system or outlet piping system.\nNormal boost pressure for modern forced air induction systems is between nine and fourteen-pounds. If actual boost pressure is within manufacturer’s specifications, suspect a defective boost pressure sensor, a bad PCM, or a PCM programming error. Use the DVOM and your vehicle information source to test the boost pressure sensor and system circuits as needed.\n"}
{"P0050\n": ""}
{"P0051\n": ""}
{"P0052\n": ""}
{"P0053\n": ""}
{"P0054\n": ""}
{"P0055\n": ""}
{"P0056\n": ""}
{"P0057\n": ""}
{"P0058\n": ""}
{"P0059\n": ""}
{"P0060\n": ""}
{"P0061\n": ""}
{"P0062\n": ""}
{"P0063\n": ""}
{"P0064\n": ""}
{"P0065\n": ""}
{"P0066\n": ""}
{"P0067\n": ""}
{"P0068\n": ""}
{"P0069\n": ""}
{"P0070\n": ""}
{"P0071\n": ""}
{"P0072\n": ""}
{"P0073\n": ""}
{"P0074\n": ""}
{"P0075\n": ""}
{"P0076\n": ""}
{"P0077\n": ""}
{"P0078\n": ""}
{"P0079\n": ""}
{"P0080\n": ""}
{"P0081\n": ""}
{"P0082\n": ""}
{"P0083\n": ""}
{"P0084\n": ""}
{"P0085\n": ""}
{"P0086\n": ""}
{"P0087\n": ""}
{"P0088\n": ""}
{"P0089\n": ""}
{"P0090\n": "\nA diagnostic scanner, a digital volt/ohmmeter (DVOM), a suitable fuel pressure gauge, and a reliable vehicle information source (such as All Data DIY) will be necessary for diagnosing a code P0090. \n\nI normally start with a visual inspection of system wiring and connectors; focusing my attention on harnesses and connectors on top of the engine. The warmth associated with this area makes it popular with pests in cold climates. These pests can damage (gnaw) system wiring and connectors.\nConnecting the scanner to the vehicle diagnostic port and retrieving the stored codes and freeze frame data would be my next task. I write this information down because it may be helpful as the diagnostic process continues. Now, I would clear the codes and test-drive the vehicle if possible.\nIf the code is immediately reset, check for voltage and ground at the fuel pressure regulator. If no voltage is discovered, test power supply relays and fuses following the wiring diagram derived from the vehicle information source. If there is no ground, follow the wiring diagram to find the appropriate location of the fuel pressure regulator control system ground/s and make sure that all are secure.\nIf there is voltage and ground at the fuel pressure control regulator, obtain fuel pressure specifications from your vehicle information source and test fuel system pressure using the fuel pressure gauge. Carefully follow manufacturer’s recommendations for connecting the fuel pressure gauge. Observe fuel system data using the scanner while visually monitoring manual fuel pressure with the fuel gauge. If fuel pressure reflected on the scanner data display does not coincide with actual fuel pressure, suspect a faulty fuel pressure sensor. \nFluctuations in actual fuel pressure should occur with variations in fuel pressure regulator control voltage. If this is not the case, suspect that the fuel pressure regulator is defective, there is an open or shorted circuit in one of the fuel pressure regulator control circuits, or that the PCM is bad.\nFollow manufacturer’s recommendations for testing the electronic fuel pressure regulator and the individual fuel pressure regulator control circuits with the DVOM. Disconnect controllers from the circuit before testing with the DVOM to prevent damage to control modules.\nAdditional diagnostic notes:\n\n Fuel rail and related components may be under high pressure. Use caution when removing the fuel pressure sensor or fuel pressure regulator\nTurn the ignition switch off to connect/disconnect the fuel pressure gauge\n\nOther fuel pressure trouble codes include:\n\n<a href=\"/p0087\">P0087 Fuel Rail/System Pressure - Too Low\n<a href=\"/p0088\">P0088 Fuel Rail/System Pressure - Too High\n<a href=\"/p0190\">P0190 Fuel Rail Pressure Sensor A Circuit\n<a href=\"/p0191\">P0191 Fuel Rail Pressure Sensor A Circuit Range/Performance\n<a href=\"/p0192\">P0192 Fuel Rail Pressure Sensor A Circuit Low Input\n<a href=\"/p0193\">P0193 Fuel Rail Pressure Sensor A Circuit High Input\n<a href=\"/p0194\">P0194 Fuel Rail Pressure Sensor A Circuit Intermittent\n\n"}
{"P0091\n": "\nIn order to diagnose a code P0091, a diagnostic scanner, a digital volt/ohmmeter (DVOM), a suitable fuel pressure gauge, and a reliable vehicle information source (such as All Data DIY) will be required. \n\nI like to begin with a visual inspection of system wiring and connectors; focusing my attention on harnesses and connectors on top of the engine. The warm upper engine area makes it popular with pests in cold climates. These pests often gnaw system wiring and connectors.\nConnect the scanner to the vehicle diagnostic port and retrieve stored codes and freeze frame data. Write this information down as it will prove helpful if the diagnostic process drags on. Clear the codes and test-drive the vehicle if possible.\nShould the code be immediately reset, check for the correct degree of voltage and a battery ground at the fuel pressure regulator. If voltage is not discovered, test power supply relays and fuses following the wiring diagram derived from the vehicle information source. If there is no ground, the wiring diagram can help to find the location of the fuel pressure regulator control system ground/s and make sure they are secure.\nThe presence of voltage and ground at the fuel pressure control regulator would prompt me to obtain fuel pressure specifications from the vehicle information source, then test fuel system pressure using the fuel pressure gauge. Always follow manufacturer’s recommendations for using the fuel pressure gauge. Use the scanner to observe fuel system data while visually monitoring manual fuel pressure with the fuel gauge. \nSuspect a faulty fuel pressure sensor if the level of fuel pressure reflected on the scanner does not coincide with actual fuel pressure. Variations in fuel pressure regulator control voltage should mirror fluctuations in actual fuel pressure. If this does not occur, suspect that either the fuel pressure regulator is defective, there is an open or shorted circuit in one of the fuel pressure regulator control circuits, or that the PCM is bad.\nUse the DVOM and follow manufacturer’s recommendations for testing the electronic fuel pressure regulator and the individual fuel pressure regulator control circuits. To prevent damage to control modules, disconnect controllers from the circuit before testing circuit resistance and continuity with the DVOM.\nAdditional diagnostic notes:\n\nFuel rail and related components may be under high pressure. Use caution when removing the fuel pressure sensor or fuel pressure regulator\nFuel pressure testing should be done with the ignition switch in the key on engine off (KOEO) position\n\nOther fuel pressure trouble codes include:\n\n<a href=\"/p0087\">P0087 Fuel Rail/System Pressure - Too Low\n<a href=\"/p0088\">P0088 Fuel Rail/System Pressure - Too High\n<a href=\"/p0190\">P0190 Fuel Rail Pressure Sensor A Circuit\n<a href=\"/p0191\">P0191 Fuel Rail Pressure Sensor A Circuit Range/Performance\n<a href=\"/p0192\">P0192 Fuel Rail Pressure Sensor A Circuit Low Input\n<a href=\"/p0193\">P0193 Fuel Rail Pressure Sensor A Circuit High Input\n<a href=\"/p0194\">P0194 Fuel Rail Pressure Sensor A Circuit Intermittent\n\n"}
{"P0092\n": "\nDiagnosing a code P0092 will require access to a diagnostic scanner, a digital volt/ohmmeter (DVOM), a suitable fuel pressure gauge, and a reliable vehicle information source (such as All Data DIY). \n\nA visual inspection of system wiring and connectors, with a focus on harnesses and connectors on top of the engine, has been fruitful for me in the past. It seems that the warm upper engine area is popular with varmints, especially in cold climates. Unfortunately, pests often gnaw system wiring and connectors repeatedly.\nNext, I would connect the scanner to the vehicle diagnostic port and retrieve stored codes and freeze frame data. Writing this information down may prove helpful if the diagnostic process drags on. Clear the codes and test-drive the vehicle if the engine will start.\nCheck for the correct degree of voltage and a battery ground at the fuel pressure regulator, if the code is reset. If no voltage is found at the fuel pressure regulator connector, test power supply relays and fuses by following the appropriate wiring diagram from the vehicle information source. If no ground is present, the wiring diagram can help you to find the location of the fuel pressure regulator control system ground/s and make sure they are secure.\nSuitable voltage and ground circuits, discovered at the fuel pressure control regulator connector, would prompt me to obtain fuel pressure specifications from the vehicle information source and test fuel system pressure using the fuel pressure gauge. Remember to follow manufacturer’s recommendations for using the fuel pressure gauge. \nMonitor manual fuel pressure with the fuel gauge while using the scanner to observe fuel system data. A defective fuel pressure sensor may be at the root of your problems if the level of fuel pressure reflected on the scanner does not coincide with actual fuel pressure. Variations in fuel pressure regulator control voltage should reflect fluctuations in actual fuel rail pressure. If not, suspect that either the fuel pressure regulator is defective, there is an open or shorted circuit in one of the fuel pressure regulator control circuits, or that the PCM is bad.\nIn order to test the electronic fuel pressure regulator and the individual fuel pressure regulator control circuits, use the DVOM and follow manufacturer’s recommendations. Disconnect controllers from the circuit before testing circuit resistance and continuity with the DVOM.\nAdditional diagnostic notes:\n\nFuel rail and related components are under high pressure. Use caution when removing the fuel pressure sensor or fuel pressure regulator\nFuel pressure testing should be done with the ignition switch in the key on engine off (KOEO) position\n\nOther fuel pressure trouble codes include:\n\n<a href=\"/p0087\">P0087 Fuel Rail/System Pressure - Too Low\n<a href=\"/p0088\">P0088 Fuel Rail/System Pressure - Too High\n<a href=\"/p0190\">P0190 Fuel Rail Pressure Sensor A Circuit\n<a href=\"/p0191\">P0191 Fuel Rail Pressure Sensor A Circuit Range/Performance\n<a href=\"/p0192\">P0192 Fuel Rail Pressure Sensor A Circuit Low Input\n<a href=\"/p0193\">P0193 Fuel Rail Pressure Sensor A Circuit High Input\n<a href=\"/p0194\">P0194 Fuel Rail Pressure Sensor A Circuit Intermittent\n\n"}
{"P0093\n": ""}
{"P0094\n": "\nA good starting point is always to check for technical service bulletins (TSB) for your particular vehicle. Your issue may be a known issue with a known fix put out by the manufacturer and can save you time and money during diagnosis.\nI would gain access to a suitable diagnostic scanner, a diesel fuel pressure gauge, a digital volt/ohmmeter (DVOM), and a vehicle service manual or a subscription to All Data (DIY), when attempting to diagnose a code of this type.\nI typically begin my diagnosis with a visual inspection of fuel lines and components. If any leaks are discovered, repair them and recheck the system. Inspect system wiring and connectors at this time.\nConnect the scanner to the vehicle diagnostic connector and retrieve al stored codes and freeze frame data. Write this information down in case this proves to be an intermittent code, which will prove much more difficult to diagnose. If other fuel system related codes are present, you may want to diagnose them first before attempting to diagnose the P0094. Clear the codes and test drive the vehicle.\nIf the P0094 is immediately reset, locate the data stream of the scanner and observe fuel pressure readings. By narrowing the data stream to include only pertinent data, you will get a quicker response. Compare the actual reflected fuel pressure readings with manufacturer’s specifications.\nIf fuel pressure is not within specs, use the fuel pressure gauge to test system pressure in the appropriate quadrant. If actual fuel pressure readings are not within manufacturer’s recommended specifications, suspect a mechanical failure. Continue by disconnecting the fuel pressure sensor connector and testing the resistance of the sensor itself. If the sensor resistance does not comply with manufacturer’s specifications, replace it and retest the system.\nIf the sensor checks out, disconnect all related controllers and begin testing system circuits for resistance and continuity. Repair or replace shorted or open circuits as required. \nIf all system sensors and circuitry seems normal, suspect a defective PCM or PCM programming error.\nAdditional diagnostic tips:\n\n Use caution when testing high pressure fuel systems. These types of systems should only be serviced by qualified personnel \n Despite this code being described as a \"small leak\" low fuel pressure is often the culprit \n\nSee also: <a href=\"/p0093\">P0093 Fuel System Leak Detected - Large Leak\n"}
{"P0095\n": ""}
{"P0096\n": ""}
{"P0097\n": ""}
{"P0098\n": ""}
{"P0099\n": "\nA good starting point is always to check for technical service bulletins (TSB) for your particular vehicle. Your issue may be a known issue with a known fix put out by the manufacturer and can save you time and money during diagnosis.\nWhen faced with diagnosing a code P0099, I like to have a suitable diagnostic scanner, a digital volt/ohmmeter (DVOM), an infrared thermometer, and a reliable vehicle information source (such as All Data DIY) at my disposal.\nConnect the scanner to the vehicle diagnostic connector and retrieve the stored trouble codes and applicable freeze frame data. I normally write this information down in case I need it later. Clear the codes and test drive the vehicle. If the code is immediately reset, proceed with the diagnostic process.\nMost professional technicians begin with a visual inspection of IAT sensor related wiring and connectors (don’t forget the air filter and the air inlet pipe). Pay careful attention to the sensor connector as it is susceptible to corrosion because of its close proximity to the battery and coolant reservoir.\nIf the system wiring, connectors, and components appear to be in working order, proceed by connecting the scanner to the diagnostic connector and opening the data stream. By narrowing the data stream to include only pertinent data, you will get a faster response. Use the infrared thermometer to make sure that the IAT reading (on the scanner) correctly reflects actual intake air temperature.\nIf it is incorrect, consult your vehicle information source for IAT sensor testing recommendations. Use the DVOM to test the sensor and compare your findings with vehicle specifications. Replace the sensor if it fails to comply. \nIf the sensor passes the resistance test, check for a sensor reference voltage and a ground. If either one of these are not present repair the open or shorted circuit and retest the system. If system reference and ground signals are present, obtain an IAT sensor voltage to temperature chart from your vehicle information source and use the DVOM to test sensor output voltage. Compare the voltage with the voltage to temperature chart and replace the sensor if actual findings vary from maximum recommended tolerances.\nIf actual IAT input voltage is within specifications, disconnect the electrical connector/s from all related controllers and use the DVOM to test resistance and continuity on all system circuits. Repair or replace circuits that prove to be open or shorted and retest the system.\nIf the IAT sensor and all system circuits are within recommended specifications, suspect a defective PCM or a PCM programming error.\nAdditional diagnostic notes:\n\nBy far, the most common cause of a P0099 being stored is a disconnected #2 IAT sensor connector. When the air filter is checked or replaced, the IAT sensor is often left disconnected. If your vehicle has recently been service, and a code P0099 is suddenly stored, suspect that the IAT sensor has simply been left unplugged.\n\nRelated IAT sensor and circuit trouble codes: <a href=\"/p0095\">P0095, <a href=\"/p0096\">P0096, <a href=\"/p0097\">P0097, <a href=\"/p0098\">P0098, <a href=\"/p0110\">P0110, <a href=\"/p0111\">P0111, <a href=\"/p0112\">P0112, <a href=\"/p0113\">P0113, <a href=\"/p0114\">P0114, <a href=\"/p0127\">P0127\n"}
{"P0100\n": ""}
{"P0101\n": ""}
{"P0102\n": ""}
{"P0103\n": ""}
{"P0104\n": ""}
{"P0105\n": ""}
{"P0106\n": ""}
{"P0107\n": ""}
{"P0108\n": ""}
{"P0109\n": "\nA good starting point is always to check for technical service bulletins (TSB) for your particular vehicle. Your issue may be a known issue with a known fix put out by the manufacturer and can save you time and money during diagnosis.\nTools that I would likely use to diagnose a P0109 are a diagnostic scanner, a digital volt/ohmmeter, a vacuum gauge, and a vehicle service manual (or online service such as All Data DIY).\nI like to begin my diagnosis with a visual inspection of system related wiring harnesses and connectors. Corroded connector faces and damaged wiring must be rectified before proceeding with the diagnostic process.\nConnect the scanner to the diagnostic connector and retrieve all stored codes and freeze frame data. Make a note of this information. It may prove useful in the event that the P0109 is an intermittent code. Clear the codes and test drive the vehicle.\nAn engine vacuum test can help to ensure that the engine is making sufficient vacuum. Consult your vehicle information source for minimum engine vacuum specifications. Poorly running engines will not produce sufficient vacuum for the MAP sensor. Ignition misfire codes should be diagnosed and repaired before attempting to diagnose a P0109. Clogged catalytic converters, restricted mufflers, and low fuel pressure may also contribute to insufficient engine vacuum.\nIf a P0109 is immediately reset, and all circuits and connectors appear to be in order, continue testing at the MAP sensor. Follow manufacturer’s recommendations for testing the MAP sensor. Use the DVOM to test resistance of the MAP sensor. If the MAP sensor fails to comply with resistance specifications, replace it. To prevent damage to related controllers, disconnect them before testing resistance levels in system circuits with the DVOM. Repair or replace open or shorted circuits as required.\nSuspect a defective PCM or a PCM programming error if the sensor and all circuits are compliant with manufacturer’s specifications.\nOther MAP Sensor engine codes include <a href=\"/p0105\">P0105, <a href=\"/p0106\">P0106, <a href=\"/p0107\">P0107, and <a href=\"/p0108\">P0108.\n"}
{"P0110\n": ""}
{"P0111\n": ""}
{"P0112\n": ""}
{"P0113\n": ""}
{"P0114\n": "\nA good starting point is always to check for technical service bulletins (TSB) for your particular vehicle. Your issue may be a known issue with a known fix put out by the manufacturer and can save you time and money during diagnosis.\nWhen faced with diagnosing a code P0114, I like to have a suitable diagnostic scanner, a digital volt/ohmmeter (DVOM), an infrared thermometer, and a reliable vehicle information source (such as All Data DIY) at my disposal.\nConnect the scanner to the vehicle diagnostic connector and retrieve the stored trouble codes and applicable freeze frame data. I normally write this information down in case I need it later. Clear the codes and test drive the vehicle. If the code is immediately reset, proceed with the diagnostic process.\nMost professional technicians begin with a visual inspection of IAT sensor related wiring and connectors (don’t forget the air filter and the air inlet pipe). Pay careful attention to the sensor connector as it is susceptible to corrosion because of its close proximity to the battery and coolant reservoir.\nIf the system wiring, connectors, and components appear to be in working order, proceed by connecting the scanner to the diagnostic connector and opening the data stream. By narrowing the data stream to include only pertinent data, you will get a faster response. Use the infrared thermometer to make sure that the IAT reading (on the scanner) correctly reflects actual intake air temperature.\nIf it is incorrect, consult your vehicle information source for IAT sensor testing recommendations. Use the DVOM to test the sensor and compare your findings with vehicle specifications. Replace the sensor if it fails to comply. \nIf the sensor passes the resistance test, check for a sensor reference voltage and a ground. If either one of these are not present repair the open or shorted circuit and retest the system. If system reference and ground signals are present, obtain an IAT sensor voltage to temperature chart from your vehicle information source and use the DVOM to test sensor output voltage. Compare the voltage with the voltage to temperature chart and replace the sensor if actual findings vary from maximum recommended tolerances.\nIf actual IAT input voltage is within specifications, disconnect the electrical connector/s from all related controllers and use the DVOM to test resistance and continuity on all system circuits. Repair or replace circuits that prove to be open or shorted and retest the system.\nIf the IAT sensor and all system circuits are within recommended specifications, suspect a defective PCM or a PCM programming error.\nAdditional diagnostic notes:\n\nBy far, the most common cause of a P0114 being stored is a disconnected IAT sensor connector. When the air filter is checked or replaced, the IAT sensor is often left disconnected. If your vehicle has recently been service, and a code P0114 is suddenly stored, suspect that the IAT sensor has simply been left unplugged.\n\nRelated IAT sensor and circuit trouble codes: <a href=\"/p0095\">P0095, <a href=\"/p0096\">P0096, <a href=\"/p0097\">P0097, <a href=\"/p0098\">P0098, <a href=\"/p0099\">P0099, <a href=\"/p0110\">P0110, <a href=\"/p0111\">P0111, <a href=\"/p0112\">P0112, <a href=\"/p0113\">P0113, <a href=\"/p0127\">P0127\n"}
{"P0115\n": ""}
{"P0116\n": ""}
{"P0117\n": ""}
{"P0118\n": ""}
{"P0119\n": "\nA good starting point is always to check for technical service bulletins (TSB) for your particular vehicle. Your issue may be a known issue with a known fix put out by the manufacturer and can save you time and money during diagnosis.\nWhen faced with diagnosing a code P0119, I like to have a suitable diagnostic scanner, a digital volt/ohmmeter (DVOM), an infrared thermometer, and a reliable vehicle information source (such as All Data DIY) on hand.\nI like to connect the scanner to the vehicle diagnostic connector, retrieve stored trouble codes and freeze frame data, and write this information down, to begin my diagnosis. Now, clear the codes.\nNext, I would perform a visual inspection of ECT sensor wiring and connectors. Repair or replace burnt or damaged wiring and/or connectors as required and retest the system. If the P0119 is not immediately reset, it may be intermittent. Operate the vehicle normally until the PCM enters OBD-II readiness mode or the code is reset. If the P0119 is now reset, continue with your diagnosis.\nReconnect the scanner and bring up the appropriate data stream. Narrow the data stream so that only pertinent data is shown and data response will be much faster. Observe the ECT sensor temperature and voltage while looking for glitches or inconsistencies. These will be seen by the PCM as intermittent ECT sensor circuit signals. If there are inconsistencies, inspect the ECT sensor connector for signs of corrosion. Check wiring that is routed near hot exhaust manifolds/headers (intermittent short to ground) and loose or broken connector pins at the ECT sensor. Repair or replace defective components as required.\nLow engine coolant may also contribute to a code P0119 being stored. With the engine cool, remove the high pressure cap and make sure that the engine is full of the recommended coolant. If the engine coolant level is down by more than several quarts, inspect the engine for a coolant leak. A cooling system pressure tester may be helpful for this. Repair leaks as necessary, refill the system with suitable coolant, and retest the system.\n If the ECT sensor is observed (in the scanner data stream display) as being extremely low or high, suspect that it is defective. Using the DVOM, test ECT sensor resistance and compare your findings with manufacturer’s recommendations. Replace the sensor if it fails to comply.\nIf the ECT sensor seems slightly low or high, use the infrared thermometer to obtain actual ECT. Compare the ECT sensor signal reflected in the data stream with actual ECT and discard the sensor if the two do not coincide.\nAdditional diagnostic notes:\n\n Make sure that the engine is full of coolant, and the thermostat is operating properly, before attempting to diagnose a P0119 \n Other ECT sensor codes, as well as engine over temp codes, may accompany this type of code \n Diagnose and repair other ECT related codes prior to diagnosing the P0119\n\nOther ECT sensor diagnostic codes include <a href=\"/p0115\">P0115, <a href=\"/p0116\">P0116, <a href=\"/p0117\">P0117, and <a href=\"/p0118\">P0118.\n"}
{"P0120\n": ""}
{"P0121\n": ""}
{"P0122\n": ""}
{"P0123\n": ""}
{"P0124\n": "\nA good starting point is always to check for technical service bulletins (TSB) for your particular vehicle. Your issue may be a known issue with a known fix put out by the manufacturer and can save you time and money during diagnosis.\nI typically use a diagnostic scanner, a digital volt/ohmmeter (DVOM), and an accurate vehicle information source (ALL DATA DIY) to diagnose a code P0124. \nA successful diagnosis usually begins with a visual inspection of all system related wiring and connectors. I also like to test the throttle plate for signs of carbon coking or damage. Repair or replace defective wiring or components as required, then recheck the throttle body and TPS.\nConnect the scanner to the diagnostic connector; retrieve all stored trouble codes and write them down for future reference. I also keep any related freeze frame data. My notes are often helpful if the stored code proves to be intermittent. Next, I would clear the codes and test-drive the vehicle. Continue with the diagnosis if the code is reset. If it is not reset, the condition may need to worsen before a correct diagnosis can be made. Operate the vehicle normally until the PCM enters readiness mode or the code is reset.\nProceed by checking for technical service bulletins (TSB) that apply to the particular malfunction (and vehicle) in question by consulting your vehicle information source. If applicable, use the information contained in the appropriate TSB to help with your diagnosis. TSBs can be especially helpful when diagnosing an intermittent condition.\nThe scanner data stream may yield useful information regarding glitches and inconsistencies in the throttle position sensor. If you narrow the scanner data stream to display only pertinent data, you will get a more accurate data response. \nIf no glitches are detected, use the DVOM to test the TPS. Using the DVOM gives you access to live data if the appropriate test leads are connected to the ground and signal circuits. Watch the DVOM display while operating the throttle manually. Look for glitches in voltage as the throttle is actuated slowly from the closed position to wide open throttle. Voltage typically ranges from .5-volts at closed throttle to 4.5-volts at wide open throttle. If glitches or other inconsistencies are detected, suspect that the sensor being tested is defective or misadjusted.\nAdditional diagnostic notes:\n\n If the TPS has been replaced and a P0124 continues to be stored, consult the vehicle information source for TPS adjustment specs \n Use the DVOM (with the test leads connected to the ground and signal circuits) to adjust the TPS accurately\n\n"}
{"P0125\n": ""}
{"P0126\n": ""}
{"P0127\n": "\nA good starting point is always to check for technical service bulletins (TSB) for your particular vehicle. Your issue may be a known issue with a known fix put out by the manufacturer and can save you time and money during diagnosis.\nWhen diagnosing a code P0127, you will need a diagnostic scanner, a digital volt/ohmmeter (DVOM), an infrared thermometer, and a reliable vehicle information source (such as All Data DIY).\nI would begin by connecting the scanner to the vehicle diagnostic connector and retrieving the stored trouble codes and applicable freeze frame data. I like to write this information down in case I need it later. Next, I’d clear the codes and test-drive the vehicle. Should the code be reset, go to the next step.\nI would proceed with a visual inspection of IAT sensor related wiring and connectors (don’t forget the air filter and the air inlet pipe). Pay careful attention to the sensor connector as it is susceptible to corrosion because of its close proximity to the battery and coolant reservoir. Check technical service bulletins (TSB) that apply to the vehicle and the malfunction in question.\nI would continue by connecting the scanner to the diagnostic connector and opening the data stream if the system wiring, connectors, and components appear to be in good working order. You can get faster response by narrowing the data stream to include only pertinent data. Using the infrared thermometer, make sure that the IAT reading (on the scanner) correctly reflects actual intake air temperature.\nIf the temperatures coincide, consult your vehicle information source for IAT sensor testing recommendations. Use the DVOM to test the sensor. Compare your findings with manufacturer’s specifications. You must replace the sensor if it fails to comply. \nCheck for sensor reference voltage and a ground at the sensor connector, if the sensor passes the resistance test. If reference voltage and grounds are not present, repair the open or shorted circuit and retest the system. If system reference and ground signals are present, find the IAT sensor voltage to temperature chart in your vehicle information source and use the DVOM to test sensor output voltage. Compare actual voltage with the temperature to voltage chart. Replace the sensor if the actual reading varies from the temp to voltage chart.\nIf IAT reference voltage is within specifications, disconnect the electrical connector/s from all related controllers and use the DVOM to test resistance and continuity in all system circuits. Circuits that prove to be open or shorted should be repaired or replaced.\nAdditional diagnostic notes:\n\nWhen the air filter is checked or replaced, the IAT sensor is often left disconnected. If your vehicle has recently been service, and a code P0127 is suddenly stored, suspect that the IAT sensor has simply been left unplugged. Reconnect it, clear the code, and drive the vehicle as normal (until the PCM enters readiness mode) to rectify the situation.\n\nRelated IAT sensor and circuit trouble codes: <a href=\"/p0095\">P0095, <a href=\"/p0096\">P0096, <a href=\"/p0097\">P0097, <a href=\"/p0098\">P0098, <a href=\"/p0099\">P0099, <a href=\"/p0110\">P0110, <a href=\"/p0111\">P0111, <a href=\"/p0112\">P0112, <a href=\"/p0113\">P0113, <a href=\"/p0114\">P0114\n"}
{"P0128\n": ""}
{"P0129\n": "\nA good starting point is always to check for technical service bulletins (TSB) for your particular vehicle. Your issue may be a known issue with a known fix put out by the manufacturer and can save you time and money during diagnosis.\nWhen I am diagnosing a P0129, I know that I will need a diagnostic scanner, a digital volt/ohmmeter (DVOM), a vacuum gauge, and a reliable vehicle information source (such as All Data DIY).\nI normally like to begin my diagnosis with a visual inspection of all system related wiring harnesses and connectors. Any damaged wiring or corroded connector faces should be repaired before proceeding with the diagnosis.\nI would continue by connecting the scanner to the vehicle diagnostic connector and retrieving all stored codes. Next, I like to make a note of all codes and freeze frame data as this information may prove useful in the event that I am dealing with an intermittent code. Next, I clear the codes and test-drive the vehicle to see if the code is reset.\nIf it is, I would perform a manual engine vacuum test to ensure that the engine is making sufficient vacuum. I would consult my vehicle information source for specifications that apply to my vehicle. If the engine is not performing efficiently, it will not produce enough vacuum for the BPS or MAP sensor. Engine misfire codes, fuel system codes, and catalytic converter codes should be diagnosed and repaired before attempting to diagnose this code. \nBe aware that barometric pressure sensors which are integrated with the MAF sensor are subject to corrosion at the connector face. These types of systems are also prone to faults caused by an extremely dirty air filter element. I have also discovered that this type of BPS configurations will often require that an auxiliary ground be installed (depending upon manufacturer). \nContinue testing at the BPS if all circuits and connectors appear to be operational. Unplug the electrical connector and check resistance across all circuits of the BPS using the DVOM. If the sensor fails to comply with specifications, replace it.\nIf the BPS meets manufacturer’s specifications, begin testing system circuits. To prevent damage, disconnect all related controllers before testing system circuits with the DVOM. Repair or replace open or shorted circuits as needed.\nSuspect a defective PCM or a PCM programming error if the sensor and all circuits are compliant with manufacturer’s specifications. Consider all other possibilities before replacement and remember that replacement of system controllers will require reprogramming.\nAdditional diagnostic notes:\n\nFor further diagnostic help, consult your vehicle information source for technical service bulletins that apply to the barometric pressure sensor, manifold absolute pressure sensor, or mass air flow sensor of your vehicle\n\n"}
{"P0130\n": ""}
{"P0131\n": ""}
{"P0132\n": ""}
{"P0133\n": ""}
{"P0134\n": ""}
{"P0135\n": ""}
{"P0136\n": ""}
{"P0137\n": ""}
{"P0138\n": ""}
{"P0139\n": ""}
{"P0140\n": ""}
{"P0141\n": ""}
{"P0142\n": ""}
{"P0143\n": ""}
{"P0144\n": ""}
{"P0145\n": "\nA good starting point is always to check for technical service bulletins (TSB) for your particular vehicle. Your issue may be a known issue with a known fix put out by the manufacturer and can save you time and money during diagnosis.\nA diagnostic scanner, digital volt ohmmeter (DVOM), and a reliable vehicle information source are tools that I would require when diagnosing a code P0145. \nMisfire codes, throttle position sensor codes, manifold air pressure code, and mass air flow sensor codes must be diagnosed and repaired prior to attempting to diagnose a code P0145. If the engine is not running efficiently a successful diagnosis cannot be reached.\nMost skilled technicians begin with a visual inspection of system wiring harnesses and connectors. I would focus on harnesses that are routed near hot exhaust pipes and manifolds, as well as those that are routed near sharp edges like the ones found on exhaust shields. \nRetrieve all stored trouble codes and freeze frame data by connecting the scanner to the vehicle diagnostic port. Write this information down because it may be helpful if the P0145 proves to be intermittent. Clear the codes and see if the P0145 is reset.\nIf the P0145 is reset, start the engine and let it idle (with the transmission in neutral or park), after allowing it to reach normal operating temperature. Observe O2 sensor input data on the scanner data stream. By narrowing the data stream display to include only pertinent data you can get a more accurate data response. If the engine is running efficiently, downstream O2 sensor data should reach a mid-line and only fluctuate slightly. If there is little or no fluctuation, a P0145 will be stored.\nTo monitor live data from the O2 sensor, connect the DVOM test leads to the sensor ground and signal wires. The DVOM may also be used to check resistance of the O2 sensor in question, as well as voltage and ground signals. Disconnect related controllers prior to testing system circuit resistance with the DVOM. \nAdditional diagnostic notes:\n\n Once the PCM has entered closed loop operation, the downstream O2 sensor should not cycle as dramatically as upstream sensors but it should cycle regularly \n Low grade replacement catalytic converters are prone to repeated failure and should be avoided\n\n"}
{"P0146\n": ""}
{"P0147\n": ""}
{"P0148\n": "\nA good starting point is always to check for technical service bulletins (TSB) for your particular vehicle. Your issue may be a known issue with a known fix put out by the manufacturer and can save you time and money during diagnosis.\nA diagnostic scanner, a digital volt/ohmmeter (DVOM), a direct fuel injection diesel fuel pressure gauge, and a vehicle information source (such as All Data DIY) will be required to diagnose a stored code P0148.\nConnect the scanner to the vehicle diagnostic connector and retrieve all stored codes and freeze frame data. It is a good idea to write this information down just in case you need it later. Now, clear the codes and proceed. If there is a strong odor of diesel fuel, suspect that a fuel leak is at the root of your problem. If a fuel leak is detected, fuel filters and other high pressure fuel system components which have been recently replaced, should be carefully inspected before proceeding. After carefully performing a visual inspection of all fuel delivery lines and components, repair leaks as needed and retest the system to see if the code is reset.\nIf there are no leaks present and the code is reset, carefully use the direct fuel injection diesel fuel pressure gauge to test fuel pressure. If actual fuel pressure fails to comply with manufacturer’s specifications, suspect a defective fuel pump, clogged fuel filter, or bad fuel pump relay. You can test fuel pump operation by using the DVOM to test voltage at the fuel pump connector and listening for fuel pump agitation when voltage is applied. Consult your vehicle information source for voltage stipulations and precautionary data. If voltage is present, as specified and there is no fuel pump agitation, suspect that the fuel pump is defective. If there is no voltage at the fuel pump connector, suspect a fuel pump or PCM relay malfunction or wiring problem.\nIf fuel pressure is normal, use the DVOM to test the fuel pressure sensor and the FCA according to recommendations found in your vehicle information source. \nIf these diagnostic steps prove to be too challenging, you might want to go ahead and replace the FCA and the fuel pressure sensor. The regularity with which they fail and cause this code to be stored, combined with the fact that these parts are usually fairly easily accessible and inexpensive, makes this a feasible consideration. Frankly, it’s what would transpire in most commercial garages.\nIf you are still having problems, use your vehicle information source to search technical service bulletins (TSB) for one that matches your specific vehicle, symptoms, and code/s. The information contained in the TSB may help you to pinpoint the malfunction and rectify the situation.\nAdditional diagnostic notes:\n\n Knowing whether actual fuel pressure is too low or too high can aid in your diagnosis\nBe very careful when removing the FCA and fuel pressure sensor (diesel fuel pressure is extremely high) \n\n"}
{"P0149\n": "\nA good starting point is always to check for technical service bulletins (TSB) for your particular vehicle. Your issue may be a known issue with a known fix put out by the manufacturer and can save you time and money during diagnosis.\nAlthough a stored code P0149 may be caused by either a mechanical failure or an electrical issue, mechanical failure is not likely unless recent related repairs have been performed. If the engine and/or the high pressure fuel pump have recently been re-timed, definitely suspect that a misalignment of the corresponding timing marks has taken place and caused this code to be stored.\nBarring a mechanical glitch, you will need a diagnostic scanner, a digital volt/ohmmeter (DVOM), and a vehicle information source like All Data DIY to diagnose a code P0149.\nRetrieve all stored codes and freeze frame data by connecting the scanner to the vehicle diagnostic connector. Write this information down just in case you need it later, then clear the codes and proceed.\nIf there is an intense fuel odor, suspect that a fuel leak is at the root of your problem. Fuel system components which have been recently replaced should be carefully inspected if a fuel leak is detected. Once you have performed a visual inspection of all fuel delivery lines and components, repair leaks as necessary and retest the system to see if the code is reset.\nTest the fuel pressure sensor, fuel control actuator, and the fuel timing solenoid as recommended in your vehicle information source, using the DVOM. Replace components which fail to meet manufacturer’s recommended specifications and retest the system. \nIf you continue to have issues, use your vehicle information source to search technical service bulletins (TSB) for one that matches your specific vehicle, symptoms, and code/s. The information contained therein may help you to pinpoint the malfunction and rectify the situation.\nAdditional diagnostic notes:\n Suspect mechanical timing issues only if recent repairs have been executed\nCaution: Diesel fuel at 40,000 psi can penetrate your bloodstream and may be fatal\n\n"}
{"P0150\n": ""}
{"P0151\n": ""}
{"P0152\n": ""}
{"P0153\n": ""}
{"P0154\n": ""}
{"P0155\n": ""}
{"P0156\n": ""}
{"P0157\n": ""}
{"P0158\n": ""}
{"P0159\n": ""}
{"P0160\n": ""}
{"P0161\n": ""}
{"P0162\n": ""}
{"P0163\n": ""}
{"P0164\n": ""}
{"P0165\n": "\nA good starting point is always to check for technical service bulletins (TSB) for your particular vehicle. Your issue may be a known issue with a known fix put out by the manufacturer and can save you time and money during diagnosis.\nA diagnostic scanner, digital volt ohmmeter (DVOM), and a reliable vehicle information source are tools that I would require when diagnosing a code P0165. \nMisfire codes, throttle position sensor codes, manifold air pressure code, and mass air flow sensor codes must be diagnosed and repaired prior to attempting to diagnose a code P0165. If the engine is not running efficiently a successful diagnosis cannot be reached.\nMost skilled technicians begin with a visual inspection of system wiring harnesses and connectors. I would focus on harnesses that are routed near hot exhaust pipes and manifolds, as well as those that are routed near sharp edges like the ones found on exhaust shields. \nRetrieve all stored trouble codes and freeze frame data by connecting the scanner to the vehicle diagnostic port. Write this information down because it may be helpful if the P0165 proves to be intermittent. Clear the codes and see if the P0165 is reset.\nIf the P0165 is reset, start the engine and let it idle (with the transmission in neutral or park), after allowing it to reach normal operating temperature. Observe O2 sensor input data on the scanner data stream. By narrowing the data stream display to include only pertinent data you can get a more accurate data response. If the engine is running efficiently, downstream O2 sensor data should reach a mid-line and only fluctuate slightly. If there is little or no fluctuation, a P0165 will be stored.\nTo monitor live data from the O2 sensor, connect the DVOM test leads to the sensor ground and signal wires. The DVOM may also be used to check resistance of the O2 sensor in question, as well as voltage and ground signals. Disconnect related controllers prior to testing system circuit resistance with the DVOM. \nAdditional diagnostic notes:\n\n Once the PCM has entered closed loop operation, the downstream O2 sensor should not cycle as dramatically as upstream sensors but it should cycle regularly \n Low grade replacement catalytic converters are prone to repeated failure and should be avoided\n\n"}
{"P0166\n": ""}
{"P0167\n": ""}
{"P0168\n": ""}
{"P0169\n": "\nA good starting point is always to check for technical service bulletins (TSB) for your particular vehicle. Your issue may be a known issue with a known fix put out by the manufacturer and can save you time and money during diagnosis.\nYou will need a diagnostic scanner, a digital volt/ohmmeter (DVOM), an oscilloscope, an infrared thermometer, and a vehicle information source (such as All Data DIY) to diagnose a code P0169. A diagnostic scanner with an integrated DVOM and a portable oscilloscope would do the job adequately.\nBegin with a visual inspection of all related wiring harnesses and connectors to increase your chances of a successful diagnosis. \nUsing the DVOM and your vehicle information source, test reference voltage at the fuel composition sensor connector. Use the DVOM to test the corresponding circuits at the PCM connector, if there is no reference voltage. If a reference voltage signal is identified at the PCM connector, repair the open circuit between the fuel composition sensor and the PCM. Caution: Before testing circuit resistance with the DVOM, disconnect all related controllers. Suspect a faulty PCM (or a programming error) if no reference voltage is present at the PCM connector. \nObserve live data in the form of waveform patterns using the oscilloscope, if the reference and ground are present at the fuel composition sensor connector. Connect the test leads to the signal and ground circuits and observe the display screen. Measure actual fuel temperature using the infrared thermometer and compare the findings with the temperature reflected by the waveform patterns on the oscilloscope. If the fuel temperature revealed on the oscilloscope fails to coincide with that of the infrared thermometer, suspect that the fuel temperature sensor is defective.\nAdditional diagnostic notes:\n\n Use the DVOM to test fuel temperature sensor resistance according to manufacturer’s recommendations\n If fuel appears to be contaminated, this code may be a reaction to the fuel composition sensor operating as it is designed\n Excessive fuel contamination may require fuel composition sensor replacement\n\n \n\n \n"}
{"P0170\n": ""}
{"P0171\n": ""}
{"P0172\n": ""}
{"P0173\n": ""}
{"P0174\n": ""}
{"P0175\n": ""}
{"P0176\n": "\nNote: The first step in the troubleshooting process for any malfunction is to research the Technical Service Bulletins for the specific vehicle by year, model and power plant. In some circumstances this can save a lot of time in the long run by pointing you in the right direction.\n<h3>Basic Steps</h3>\n\n Examine the condition of the fuel cap\nExamine the condition of the fuel for contamination\nVisually inspect the circuit connections and wiring\nVisually inspect the condition of the fuel lines for obvious defects\nCheck electrical connections for security and corrosion\n\n<h3>Advanced Steps</h3>\nNote: The advanced steps become very vehicle specific and require the appropriate advanced equipment to perform accurately. These procedures require a digital multi meter and the specific technical references for the vehicle. Voltage requirements will very based of the specific year, model and engine in the vehicle.\n<h3>Circuit Checks</h3>\nWith the key in the off position and with the sensor and ECM connected check for power and ground referencing the appropriate technical data. Ground should always read 0 volts and power should be 5 volts or 12 volts based on the vehicle and the system configuration. The specific technical manual or online reference material for your vehicle will guide you through this process. If all of these readings are correct the associated component most likely requires replacement. Frequency checks are recommended in some troubleshooting procedures to specifically pinpoint the source of the malfunction.\nIf this process identifies the absence of a power source or ground, continuity testing may be required to check the integrity of the wiring. Continuity tests should always by performed with the power removed from the circuit and the normal readings should be 0 ohms of resistance unless otherwise specified by the technical data. Resistance or no continuity is an indication of faulty wiring that must be repaired or replaced.\nHopefully, the information in this article has been helpful to point you in the right direction to correct the problem with your fuel composition sensor circuit malfunction. This article is strictly informational and the specific technical data and service bulletins for your vehicle should always take priority. \n"}
{"P0177\n": "\nI have only encountered this code one time in the field and it turned out to be a man-made problem. The customer had installed a 0 gauge audio amp power wire running directly in over the harness containing the FFS circuit. The magnetic field created by the amperage running through the power wire interfered with the frequency output of the FFS to the point that it sent a false signal of 145hz to the PCM. \nAlthough I have never encountered a faulty FFS it is a definite possible cause for this code but not as probable as electrical interference caused by aftermarket add ons or faulty ignition components. \nA PCM failure in the FFS circuit would be very rare. \n"}
{"P0178\n": "\nNote: The first step in the troubleshooting process for any malfunction is to research the Technical Service Bulletins for the specific vehicle by year, model and power plant. In some circumstances this can save a lot of time in the long run by pointing you in the right direction.\n<h3>Basic Steps</h3>\n\n Examine the condition of the fuel cap\nExamine the condition of the fuel for contamination\nVisually inspect the circuit connections and wiring\nVisually inspect the condition of the fuel lines for obvious defects\nCheck electrical connections for security and corrosion\n\n<h3>Advanced Steps</h3>\nNote: The advanced steps become very vehicle specific and require the appropriate advanced equipment to perform accurately. These procedures require a digital multi meter and the specific technical references for the vehicle. Voltage requirements will very based of the specific year, model and engine in the vehicle.\n<h3>Circuit Checks</h3>\nWith the key in the off position and with the sensor and ECM connected check for power and ground referencing the appropriate technical data. Ground should always read 0 volts and power should be 5 volts or 12 volts based on the vehicle and the system configuration. The specific technical manual or online reference material for your vehicle will guide you through this process. If all of these readings are correct the associated component most likely requires replacement. Frequency checks are recommended in some troubleshooting procedures to specifically pinpoint the source of the malfunction.\nIf this process identifies the absence of a power source or ground, continuity testing may be required to check the integrity of the wiring. Continuity tests should always by performed with the power removed from the circuit and the normal readings should be 0 ohms of resistance unless otherwise specified by the technical data. Resistance or no continuity is an indication of faulty wiring that must be repaired or replaced.\nHopefully, the information in this article has been helpful to point you in the right direction to correct the problem with your fuel composition sensor circuit malfunction. This article is strictly informational and the specific technical data and service bulletins for your vehicle should always take priority. \n"}
{"P0180\n": "\nA good starting point is always to check for technical service bulletins (TSB) for your particular vehicle. Your issue may be a known issue with a known fix put out by the manufacturer and can save you time and money during diagnosis.\nTo diagnose a code P0180, I would typically gain access to a diagnostic scanner, a digital volt/ohmmeter (DVOM), an oscilloscope, an infrared thermometer, and a vehicle information source like All Data DIY. Some scanners have a DVOM and a portable oscilloscope built-in; that would serve you well in this scenario.\nI like to begin any diagnosis with a visual inspection of all related wiring harnesses and connectors. Repair or replace damaged or burnt components as required and retest the system. When multiple failure cycles are required for MIL illumination, I have found that using OBD II readiness mode helpful. When I have completed my repairs, I clear the codes and operate the vehicle normally. If the PCM enters readiness mode, I know that my repairs were successful. If the code is reset, I know that a malfunction still exists.\nThe fuel temperature sensor (integrated into the fuel composition sensor) is typically supplied with a five-volt reference voltage and a ground. The variable resistance sensor completes the circuit. Use the DVOM to test reference voltage and ground at the fuel temp sensor connector. If reference voltage is not present, use the DVOM to test the corresponding circuits at the PCM connector. Repair open circuits as required if there is a reference voltage signal at the PCM connector. Caution: See note at the bottom of the page regarding disconnecting the controllers. If no reference voltage is present at the PCM connector, suspect a faulty PCM or a programming error. PCM replacement or reprogramming will require professional assistance. If there is no fuel temp sensor ground, use your vehicle information source and locate the appropriate ground to make sure that it is secure. \nIf the reference and ground are present at the fuel temperature sensor A connector, connect the test leads of the oscilloscope to the appropriate circuits and observe live data in the form of waveform patterns. Use the infrared thermometer to measure actual fuel temperature and compare it with the temperature reflected by the waveform patterns on the oscilloscope. If the fuel temperature reflected by the fuel temperature sensor fails to coincide with that of the thermometer, suspect that the fuel temperature sensor is defective.\nAdditional diagnostic notes:\n\n Use the DVOM to test fuel temperature sensor resistance according to manufacturer’s recommendations \n Disconnect all related controllers prior to testing circuit resistance with the DVOM \n\n"}
{"P0181\n": "\nA good starting point is always to check for technical service bulletins (TSB) for your particular vehicle. Your issue may be a known issue with a known fix put out by the manufacturer and can save you time and money during diagnosis.\nI would typically gain access to a diagnostic scanner, a digital volt/ohmmeter (DVOM), an oscilloscope, an infrared thermometer, and a vehicle information source like All Data DIY to diagnose a code P0181. A scanner with a DVOM and a portable oscilloscope (built-in) would serve you well.\nA good place to start any diagnosis is with a visual inspection of all related wiring harnesses and connectors. All damaged or burnt components will need to be repaired or replaced; then retest the system. I have found that, when multiple failure cycles are required for MIL illumination, using the OBD II readiness mode can be helpful. When all repairs are completed, I clear the codes and drive the vehicle as usual. I know that my repairs were successful if the PCM enters readiness mode. I know that a malfunction still exists if the code is reset.\nIntegrated into the fuel composition sensor, the fuel temperature sensor is typically supplied with a five-volt reference voltage and a ground. The variable resistance sensor completes the circuit and provides the PCM with a fluctuating fuel temperature voltage signal. \nThe DVOM can be used to test reference voltage and ground at the fuel temp sensor connector. Use the DVOM to test the corresponding circuits at the PCM connector if reference voltage is not present. Repair open circuits as required. If no reference voltage is discovered at the PCM connector, suspect a faulty PCM or a programming error. \nIf the reference and ground are both present at the fuel temperature sensor connector, connect the test leads of the oscilloscope to the ground and signal circuits to observe live data in the form of waveform patterns. Measure actual fuel temperature using the infrared thermometer and compare it with the temperature reflected by the waveform patterns on the oscilloscope. Suspect that the fuel temperature sensor is defective if the fuel temperature reflected by the fuel temperature sensor fails to coincide with that of the thermometer.\nAdditional diagnostic notes:\n\n Use the DVOM to test fuel temperature sensor resistance according to manufacturer’s recommendations\nNOTE: Disconnect all related controllers prior to testing circuit resistance with the DVOM \n\n"}
{"P0182\n": "\nA good starting point is always to check for technical service bulletins (TSB) for your particular vehicle. Your issue may be a known issue with a known fix put out by the manufacturer and can save you time and money during diagnosis.\nIn my opinion, the most complete tool for diagnosing a code P0182 is a diagnostic scanner with an integrated DVOM and an oscilloscope. An infrared thermometer and a vehicle information source (like All Data DIY) will also be useful.\nAn excellent starting point for any diagnosis is a visual inspection of all related wiring harnesses and connectors. Damaged or burnt wiring and connectors will need to be repaired or replaced. Once that is completed, you will want to clear the codes and retest the system. I have discovered from experience that even the OBD II readiness mode can help when multiple failure cycles are required for MIL illumination. It is simple to complete your repairs and clear the codes, then drive the vehicle normally. If the PCM enters readiness mode, your repairs were successful. However, you’ll know that a malfunction still exists if the code is reset.\nThe fuel composition sensor is normally supplied with a five-volt reference signal and a ground. A variable resistance sensor, the fuel composition sensor completes the circuit and provides the PCM with a fluctuating fuel temperature voltage signal. Next, I would test reference voltage and ground at the fuel temp sensor connector using the DVOM. If reference voltage is not present at the fuel temperature sensor connector, I would use the DVOM to test corresponding circuits at the PCM connector. If no reference voltage is discovered at the PCM connector, I know that a faulty PCM or a PCM programming error may be at the root of my malfunction. \nUsing the oscilloscope, observe live data in waveform patterns, by connecting the test leads to the ground and signal circuits, if the reference and ground are both present at the fuel temperature sensor connector. Compare actual fuel temperature (obtained using the infrared thermometer) with the temperature reflected by the waveform patterns on the oscilloscope. If the fuel temperature (reflected by the fuel temperature sensor) fails to coincide with that of the thermometer, I would suspect that the fuel temperature sensor is defective.\nAdditional diagnostic notes:\n\n NOTE: Disconnect all related controllers prior to testing circuit resistance with the DVOM\nUse the DVOM to test fuel temperature sensor resistance according to manufacturer’s recommendations\n\n"}
{"P0183\n": "\nA good starting point is always to check for technical service bulletins (TSB) for your particular vehicle. Your issue may be a known issue with a known fix put out by the manufacturer and can save you time and money during diagnosis.\nPossibly the most complete tool for diagnosing a code P0183 is a diagnostic scanner with an integrated DVOM and oscilloscope. An infrared thermometer and a vehicle information source (like All Data DIY) can also be very helpful.\nA visual inspection of all related wiring harnesses and connectors is an appropriate beginning to any diagnosis. Damaged, burnt, or corroded wiring and connectors will need to be repaired or replaced. Next, clear the codes and retest the system. Utilize the OBD II readiness mode when multiple failure cycles are required for MIL illumination. Simply complete your repairs and clear the codes, then drive the vehicle normally. If the PCM enters readiness mode, your repairs were effective. By the same token, the malfunction still exists if the code is reset.\nFuel composition sensor operation is normally accomplished with a five-volt reference signal and a ground. The variable resistance fuel composition sensor completes the circuit and provides the PCM with a fluctuating fuel temperature voltage signal. Continue by testing reference voltage and ground at the fuel temp sensor connector using the DVOM. If reference voltage is not present at the fuel temperature sensor connector, use the DVOM to test parallel circuits at the PCM connector. If no reference voltage is discovered at the PCM connector, a faulty PCM or a PCM programming error may be the problem. Consider PCM failure only as a last resort.\nBy using the oscilloscope, you can observe live data in waveform patterns if the reference and ground are both present at the fuel temperature sensor connector. Connect the test leads to the ground and signal circuits and observe the waveform patterns on the display screen. Use the infrared thermometer to obtain actual fuel temperature and compare it with the temperature reflected by the waveform patterns on the oscilloscope. If the fuel temperature reflected by the waveform voltage patterns fails to coincide with that of the thermometer, suspect that the fuel temperature sensor is defective.\nAdditional diagnostic notes:\n\n Use the DVOM to test fuel temperature sensor resistance according to manufacturer’s recommendations\nNOTE: Disconnect all related controllers prior to testing circuit resistance with the DVOM \n\n \n\n \n"}
{"P0184\n": "\nA good starting point is always to check for technical service bulletins (TSB) for your particular vehicle. Your issue may be a known issue with a known fix put out by the manufacturer and can save you time and money during diagnosis.\nA diagnostic scanner, with an integrated DVOM and an oscilloscope, is possibly the best tool for diagnosing a code P0184. A vehicle information source (like All Data DIY) and an infrared thermometer can also be very beneficial.\nAn appropriate beginning to any diagnosis is a visual inspection of all related wiring harnesses and connectors. Damaged, burnt, or corroded wiring and connectors must be repaired or replaced. Next, you will want to clear the codes and retest the system. I like to utilize the OBD II readiness mode when multiple failure cycles are required for MIL illumination. When the repairs are completed, clear the codes then drive the vehicle normally. Your repairs were successful if the PCM enters readiness mode. The malfunction still exists if the code is reset. A five-volt reference signal and a ground are supplied to the fuel composition sensor which is of the variable resistance variety. The fuel composition sensor completes the circuit and provides the PCM with a fluctuating fuel temperature voltage signal. Test reference voltage and ground at the fuel temp sensor connector using the DVOM. If you don’t find reference voltage at the fuel temperature sensor connector, use the DVOM to test corresponding circuits at the PCM connector. If no reference voltage is discovered at the PCM connector, suspect a defective PCM or a PCM programming error. Contemplate PCM failure only as a last resort.\nUsing the oscilloscope, you can monitor live data in waveform patterns if the reference and ground are both present at the fuel temperature sensor connector. Use the infrared thermometer to obtain actual fuel temperature and compare it with the temperature revealed by the waveform patterns on the oscilloscope. If the fuel temperature, revealed by the waveform voltage patterns, fails to coincide with that of the thermometer, suspect that the fuel temperature sensor is bad.\nAdditional diagnostic notes:\n\n Use the DVOM to test fuel temperature sensor resistance according to manufacturer’s recommendations\nNOTE: Disconnect all related controllers prior to testing circuit resistance with the DVOM \n\n"}
{"P0185\n": "\nA good starting point is always to check for technical service bulletins (TSB) for your particular vehicle. Your issue may be a known issue with a known fix put out by the manufacturer and can save you time and money during diagnosis.\nTo diagnose a code P0185, I would typically gain access to a diagnostic scanner, a digital volt/ohmmeter (DVOM), an oscilloscope, an infrared thermometer, and a vehicle information source like All Data DIY. Some scanners have a DVOM and a portable oscilloscope built-in; that would serve you well in this scenario.\nI like to begin any diagnosis with a visual inspection of all related wiring harnesses and connectors. Repair or replace damaged or burnt components as required and retest the system. When multiple failure cycles are required for MIL illumination, I have found that using OBD II readiness mode helpful. When I have completed my repairs, I clear the codes and operate the vehicle normally. If the PCM enters readiness mode, I know that my repairs were successful. If the code is reset, I know that a malfunction still exists.\nThe fuel temperature sensor (integrated into the fuel composition sensor) is typically supplied with a five-volt reference voltage and a ground. The variable resistance sensor completes the circuit. Use the DVOM to test reference voltage and ground at the fuel temp sensor connector. If reference voltage is not present, use the DVOM to test the corresponding circuits at the PCM connector. Repair open circuits as required if there is a reference voltage signal at the PCM connector. Caution: See note at the bottom of the page regarding disconnecting the controllers. If no reference voltage is present at the PCM connector, suspect a faulty PCM or a programming error. PCM replacement or reprogramming will require professional assistance. If there is no fuel temp sensor ground, use your vehicle information source and locate the appropriate ground to make sure that it is secure. \nIf the reference and ground are present at the fuel temperature sensor B connector, connect the test leads of the oscilloscope to the appropriate circuits and observe live data in the form of waveform patterns. Use the infrared thermometer to measure actual fuel temperature and compare it with the temperature reflected by the waveform patterns on the oscilloscope. If the fuel temperature reflected by the fuel temperature sensor fails to coincide with that of the thermometer, suspect that the fuel temperature sensor is defective.\nAdditional diagnostic notes:\n\n Use the DVOM to test fuel temperature sensor B resistance according to manufacturer’s recommendations \n Disconnect all related controllers prior to testing circuit resistance with the DVOM \n\n"}
{"P0186\n": "\nA good starting point is always to check for technical service bulletins (TSB) for your particular vehicle. Your issue may be a known issue with a known fix put out by the manufacturer and can save you time and money during diagnosis.\nI would typically gain access to a diagnostic scanner, a digital volt/ohmmeter (DVOM), an oscilloscope, an infrared thermometer, and a vehicle information source like All Data DIY to diagnose a code P0186. A scanner with a DVOM and a portable oscilloscope (built-in) would serve you well.\nA good place to start any diagnosis is with a visual inspection of all related wiring harnesses and connectors. All damaged or burnt components will need to be repaired or replaced; then retest the system. I have found that, when multiple failure cycles are required for MIL illumination, using the OBD II readiness mode can be helpful. When all repairs are completed, I clear the codes and drive the vehicle as usual. I know that my repairs were successful if the PCM enters readiness mode. I know that a malfunction still exists if the code is reset.\nIntegrated into the fuel composition sensor, the fuel temperature sensor is typically supplied with a five-volt reference voltage and a ground. The variable resistance sensor completes the circuit and provides the PCM with a fluctuating fuel temperature voltage signal. \nThe DVOM can be used to test reference voltage and ground at the fuel temp sensor connector. Use the DVOM to test the corresponding circuits at the PCM connector if reference voltage is not present. Repair open circuits as required. If no reference voltage is discovered at the PCM connector, suspect a faulty PCM or a programming error. \nIf the reference and ground are both present at the fuel temperature sensor connector, connect the test leads of the oscilloscope to the ground and signal circuits to observe live data in the form of waveform patterns. Measure actual fuel temperature using the infrared thermometer and compare it with the temperature reflected by the waveform patterns on the oscilloscope. Suspect that the fuel temperature sensor is defective if the fuel temperature reflected by the fuel temperature sensor fails to coincide with that of the thermometer.\nAdditional diagnostic notes:\n\n Use the DVOM to test fuel temperature sensor resistance according to manufacturer’s recommendations\nNOTE: Disconnect all related controllers prior to testing circuit resistance with the DVOM \n\n"}
{"P0187\n": "\nA good starting point is always to check for technical service bulletins (TSB) for your particular vehicle. Your issue may be a known issue with a known fix put out by the manufacturer and can save you time and money during diagnosis.\nIn my opinion, the most complete tool for diagnosing a code P0187 is a diagnostic scanner with an integrated DVOM and an oscilloscope. An infrared thermometer and a vehicle information source (like All Data DIY) will also be useful.\nAn excellent starting point for any diagnosis is a visual inspection of all related wiring harnesses and connectors. Damaged or burnt wiring and connectors will need to be repaired or replaced. Once that is completed, you will want to clear the codes and retest the system. I have discovered from experience that even the OBD II readiness mode can help when multiple failure cycles are required for MIL illumination. It is simple to complete your repairs and clear the codes, then drive the vehicle normally. If the PCM enters readiness mode, your repairs were successful. However, you’ll know that a malfunction still exists if the code is reset.\nThe fuel composition sensor is normally supplied with a five-volt reference signal and a ground. A variable resistance sensor, the fuel composition sensor completes the circuit and provides the PCM with a fluctuating fuel temperature voltage signal. Next, I would test reference voltage and ground at the fuel temp sensor connector using the DVOM. If reference voltage is not present at the fuel temperature sensor connector, I would use the DVOM to test corresponding circuits at the PCM connector. If no reference voltage is discovered at the PCM connector, I know that a faulty PCM or a PCM programming error may be at the root of my malfunction. \nUsing the oscilloscope, observe live data in waveform patterns, by connecting the test leads to the ground and signal circuits, if the reference and ground are both present at the fuel temperature sensor connector. Compare actual fuel temperature (obtained using the infrared thermometer) with the temperature reflected by the waveform patterns on the oscilloscope. If the fuel temperature (reflected by the fuel temperature sensor) fails to coincide with that of the thermometer, I would suspect that the fuel temperature sensor is defective.\nAdditional diagnostic notes:\n\n NOTE: Disconnect all related controllers prior to testing circuit resistance with the DVOM\nUse the DVOM to test fuel temperature sensor resistance according to manufacturer’s recommendations\n\n"}
{"P0188\n": "\nA good starting point is always to check for technical service bulletins (TSB) for your particular vehicle. Your issue may be a known issue with a known fix put out by the manufacturer and can save you time and money during diagnosis.\nPossibly the most complete tool for diagnosing a code P0188 is a diagnostic scanner with an integrated DVOM and oscilloscope. An infrared thermometer and a vehicle information source (like All Data DIY) can also be very helpful.\nA visual inspection of all related wiring harnesses and connectors is an appropriate beginning to any diagnosis. Damaged, burnt, or corroded wiring and connectors will need to be repaired or replaced. Next, clear the codes and retest the system. Utilize the OBD II readiness mode when multiple failure cycles are required for MIL illumination. Simply complete your repairs and clear the codes, then drive the vehicle normally. If the PCM enters readiness mode, your repairs were effective. By the same token, the malfunction still exists if the code is reset.\nFuel composition sensor operation is normally accomplished with a five-volt reference signal and a ground. The variable resistance fuel composition sensor completes the circuit and provides the PCM with a fluctuating fuel temperature voltage signal. Continue by testing reference voltage and ground at the fuel temp sensor connector using the DVOM. If reference voltage is not present at the fuel temperature sensor connector, use the DVOM to test parallel circuits at the PCM connector. If no reference voltage is discovered at the PCM connector, a faulty PCM or a PCM programming error may be the problem. Consider PCM failure only as a last resort.\nBy using the oscilloscope, you can observe live data in waveform patterns if the reference and ground are both present at the fuel temperature sensor connector. Connect the test leads to the ground and signal circuits and observe the waveform patterns on the display screen. Use the infrared thermometer to obtain actual fuel temperature and compare it with the temperature reflected by the waveform patterns on the oscilloscope. If the fuel temperature reflected by the waveform voltage patterns fails to coincide with that of the thermometer, suspect that the fuel temperature sensor is defective.\nAdditional diagnostic notes:\n\n Use the DVOM to test fuel temperature sensor resistance according to manufacturer’s recommendations\nNOTE: Disconnect all related controllers prior to testing circuit resistance with the DVOM \n\n"}
{"P0189\n": "\nA good starting point is always to check for technical service bulletins (TSB) for your particular vehicle. Your issue may be a known issue with a known fix put out by the manufacturer and can save you time and money during diagnosis.\nA diagnostic scanner, with an integrated DVOM and an oscilloscope, is possibly the best tool for diagnosing a code P0189. A vehicle information source (like All Data DIY) and an infrared thermometer can also be very beneficial.\nAn appropriate beginning to any diagnosis is a visual inspection of all related wiring harnesses and connectors. Damaged, burnt, or corroded wiring and connectors must be repaired or replaced. Next, you will want to clear the codes and retest the system. I like to utilize the OBD II readiness mode when multiple failure cycles are required for MIL illumination. When the repairs are completed, clear the codes then drive the vehicle normally. Your repairs were successful if the PCM enters readiness mode. The malfunction still exists if the code is reset. A five-volt reference signal and a ground are supplied to the fuel composition sensor which is of the variable resistance variety. The fuel composition sensor completes the circuit and provides the PCM with a fluctuating fuel temperature voltage signal. Test reference voltage and ground at the fuel temp sensor connector using the DVOM. If you don’t find reference voltage at the fuel temperature sensor connector, use the DVOM to test corresponding circuits at the PCM connector. If no reference voltage is discovered at the PCM connector, suspect a defective PCM or a PCM programming error. Contemplate PCM failure only as a last resort.\nUsing the oscilloscope, you can monitor live data in waveform patterns if the reference and ground are both present at the fuel temperature sensor connector. Use the infrared thermometer to obtain actual fuel temperature and compare it with the temperature revealed by the waveform patterns on the oscilloscope. If the fuel temperature, revealed by the waveform voltage patterns, fails to coincide with that of the thermometer, suspect that the fuel temperature sensor is bad.\nAdditional diagnostic notes:\n\n Use the DVOM to test fuel temperature sensor resistance according to manufacturer’s recommendations\nNOTE: Disconnect all related controllers prior to testing circuit resistance with the DVOM \n\n"}
{"P0190\n": "\nA good starting point is always to check for technical service bulletins (TSB) for your particular vehicle. Your issue may be a known issue with a known fix put out by the manufacturer and can save you time and money during diagnosis. \nNext, locate Fuel Rail Pressure Sensor on your particular vehicle. It may look similar to this one:\n\nOnce located, visually inspect the connectors and wiring. Look for chafing, rubbing, bare wires, burn spots or melted plastic. Pull the connectors apart and carefully inspect the terminals (the metal parts) inside the connectors. See if they look corroded, burnt or possibly green in color versus the normal metal color you are probably used to seeing. You can get some Electrical Contact cleaner at any parts store if cleaning of the terminals is needed. If this is not possible, find some 91% rubbing alcohol and a light plastic bristle brush to clean them with. Afterwards let them air dry, get some dielectric silicone compound (same stuff they use for light bulb sockets and spark plug wires) and put some where the terminals come into contact. \nIf you have a scan tool, clear the diagnostic trouble codes from memory, and see if this code returns. If it does not, then the connections were most likely your problem.\nIf the code does return, we will need to test the sensor and its associated circuits. Typically there are 3 wires at the FRP sensor. Disconnect the harness going to the FRP Sensor. With a Digital Volt Ohm Meter (DVOM), test the 5V power supply circuit going to the sensor to insure it is being powered up (Red lead to the 5V power supply circuit, black lead to a good ground). If there is 12 volts to the sensor when there should be 5 volts, repair the wiring from the PCM to the sensor for a short to 12 volts, or possibly a bad PCM. \nIf that’s OK, with a DVOM, check to make sure you have 5V on the FRP Sensor signal circuit (Red lead to the sensor signal circuit, black lead to a good ground). If there is no 5 volts to the sensor, or if you see 12 volts to the sensor, repair the wiring from the PCM to the sensor, or once again a possible bad PCM. \nIf that’s OK, check to make sure you have a good ground at the FRP sensor. Connect a test light to 12V battery positive (red terminal) and touch the other end of the test light to the ground circuit going to the FRP Sensor circuit ground. If the test light does not light up, this would indicate the problem circuit. If it does light up, wiggle the wiring harness going to the FRP sensor to see if the test light flickers, indicating an intermittent connection.\nIf all tests have passed and you still get a code P0190, this would most likely indicate a failed PCM. A hard reset (battery disconnect) would recommended before any PCM replacement could be justified. A Fuel Rail Pressure Sensor may have to be replaced as well.\n\n"}
{"P0191\n": "\nA good starting point is always to check for technical service bulletins (TSB) for your particular vehicle. Your issue may be a known issue with a known fix put out by the manufacturer and can save you time and money during diagnosis. \nAlso, with this particular code, make sure you have no fuel pump/fuel pressure related codes. If you have any other codes that point to a fuel pump related issue, diagnose that code first and disregard the P0191 code. Especially when it comes to a no-start related issue.\nNext, locate Fuel Rail Pressure Sensor on your particular vehicle. It may look similar to this one:\n\nOnce located, visually inspect the connectors and wiring. Look for chafing, rubbing, bare wires, burn spots or melted plastic. Pull the connectors apart and carefully inspect the terminals (the metal parts) inside the connectors. See if they look corroded, burnt or possibly green in color versus the normal metal color you are probably used to seeing. You can get some Electrical Contact cleaner at any parts store if cleaning of the terminals is needed. If this is not possible, find some 91% rubbing alcohol and a light plastic bristle brush to clean them with. Afterwards let them air dry, get some dielectric silicone compound (same stuff they use for light bulb sockets and spark plug wires) and put some where the terminals come into contact. \nNext, make sure that the vacuum hose that connects the sensor to the intake manifold is not leaking (if used). Visually inspect all vacuum hose connections at the fuel rail pressure sensor and intake manifold. Replace as needed. \nIf you have a scan tool, clear the diagnostic trouble codes from memory, and see if this code returns. If it does not, then the connections were most likely your problem.\nIf the code does return, we will need to test the sensor against a mechanical gauge. First turn the key off, then hook up the fuel pressure gauge. Next connect the scan tool and monitor fuel pressure on the scan tool. Turn the key on and note the pressure on the gauge versus what the scan tool reads. The scan tool and the gauge should be within 5 psi of each other. \nIf all tests have passed so far, and you continue to get a P0191 code, the last thing to check is the connections at the PCM. Pull the connectors apart and carefully inspect the terminals (the metal parts) inside the connectors. See if they look corroded, burnt or possibly green in color versus the normal metal color you are probably used to seeing. \nIf all tests have passed and you still get a code P0191, this would most likely indicate a failed PCM. A hard reset (battery disconnect) would recommended before any PCM replacement could be justified. A Fuel Rail Pressure Sensor may have to be replaced as well.\n\n"}
{"P0192\n": "\nA good starting point is always to check for technical service bulletins (TSB) for your particular vehicle. Your issue may be a known issue with a known fix put out by the manufacturer and can save you time and money during diagnosis.\nNext, locate Fuel Rail Pressure Sensor on your particular vehicle. It may look similar to this one:\n\nOnce located, visually inspect the connectors and wiring. Look for chafing, rubbing, bare wires, burn spots or melted plastic. Pull the connectors apart and carefully inspect the terminals (the metal parts) inside the connectors. See if they look corroded, burnt or possibly green in color versus the normal metal color you are probably used to seeing. You can get some Electrical Contact cleaner at any parts store if cleaning of the terminals is needed. If this is not possible, find some 91% rubbing alcohol and a light plastic bristle brush to clean them with. Afterwards let them air dry, get some dielectric silicone compound (same stuff they use for light bulb sockets and spark plug wires) and put some where the terminals come into contact. \nNext, make sure that the vacuum hose that connects the sensor to the intake manifold is not leaking (if used). Visually inspect all vacuum hose connections at the FRP sensor and intake manifold. Note if any fuel comes out of the vacuum hose. If so, the fuel rail pressure sensor is defective. Replace as needed. \nIf you have a scan tool, clear the diagnostic trouble codes from memory, and see if this code returns. If it does not, then the connections were most likely your problem.\nIf the code does return, we will need to test the sensor and its associated circuits. Typically there are 3 wires at the FRP sensor. Disconnect the harness going to the FRP Sensor. For this code, the easiest thing to do is take a fused jumper wire (that’s a jumper wire with a fuse in line; it protects the circuit you are testing) and connect the 5V power supply wire to the FRP Signal input wire. With the scan tool hooked up, monitor the FRP Sensor volts. It should now read close to 5 volts. If a scan tool is not available that has a data stream, then see if code <a href=\"/p0193\">P0193 FRP Sensor Circuit High Input is now set. If either of these have occurred, then the wiring and PCM are good. The most likely problem is the sensor itself. \nIf all tests have passed so far, and you continue to get a P0192 code, this would most likely indicate a failed FRP sensor, although a failed PCM could not be ruled out until the sensor had been replaced.\n\n"}
{"P0193\n": "\nA good starting point is always to check for technical service bulletins (TSB) for your particular vehicle. Your issue may be a known issue with a known fix put out by the manufacturer and can save you time and money during diagnosis.\nNext, locate Fuel Rail Pressure Sensor on your particular vehicle. It may look similar to this one:\n\nOnce located, visually inspect the connectors and wiring. Look for chafing, rubbing, bare wires, burn spots or melted plastic. Pull the connectors apart and carefully inspect the terminals (the metal parts) inside the connectors. See if they look corroded, burnt or possibly green in color versus the normal metal color you are probably used to seeing. You can get some Electrical Contact cleaner at any parts store if cleaning of the terminals is needed. If this is not possible, find some 91% rubbing alcohol and a light plastic bristle brush to clean them with. Afterwards let them air dry, get some dielectric silicone compound (same stuff they use for light bulb sockets and spark plug wires) and put some where the terminals come into contact. \nNext, make sure that the vacuum hose that connects the sensor to the intake manifold is not leaking (if used). Visually inspect all vacuum hose connections at the fuel rail pressure sensor and intake manifold. Note if any fuel comes out of the vacuum hose. If so, the fuel rail pressure sensor is defective. Replace as needed. \nIf you have a scan tool, clear the diagnostic trouble codes from memory, and see if this code returns. If it does not, then the connections were most likely your problem.\nIf the code does return, we will need to test the sensor and its associated circuits. Typically there are 3 wires at the FRP sensor. Disconnect the harness going to the FRP Sensor. For this code, the easiest thing to do is take a fused jumper wire (that’s a jumper wire with a fuse in line; it protects the circuit you are testing) and connect the SIG RTN wire to the FRP Signal input wire. With the scan tool hooked up, monitor the FRP Sensor volts. It should now read close to zero volts. If a scan tool is not available that has a data stream, then see if code <a href=\"/p0192\">P0192 FRP Sensor Circuit Low Input is now set. If either of these have occurred, then the wiring and PCM are good. The most likely problem is the sensor itself. \nIf all tests have passed so far, and you continue to get a P0193 code, this would most likely indicate a failed FRP sensor, although a failed PCM could not be ruled out until the sensor had been replaced.\n\n"}
{"P0194\n": "\nA good starting point is always to check for technical service bulletins (TSB) for your particular vehicle. Your issue may be a known issue with a known fix put out by the manufacturer and can save you time and money during diagnosis. \nAlso, with this particular code, make sure you have no fuel pump/fuel pressure related codes. If you have any other codes that point to a fuel pump related issue, diagnose that code first and disregard the P0194 code.\nNext, locate Fuel Rail Pressure Sensor on your particular vehicle. It may look similar to this one:\n\nOnce located, visually inspect the connectors and wiring. Look for chafing, rubbing, bare wires, burn spots or melted plastic. Pull the connectors apart and carefully inspect the terminals (the metal parts) inside the connectors. See if they look corroded, burnt or possibly green in color versus the normal metal color you are probably used to seeing. You can get some Electrical Contact cleaner at any parts store if cleaning of the terminals is needed. If this is not possible, find some 91% rubbing alcohol and a light plastic bristle brush to clean them with. Afterwards let them air dry, get some dielectric silicone compound (same stuff they use for light bulb sockets and spark plug wires) and put some where the terminals come into contact. \nNext, make sure that the vacuum hose that connects the sensor to the intake manifold is not leaking (if used). Visually inspect all vacuum hose connections at the fuel rail pressure sensor and intake manifold. Replace as needed. \nIf you have a scan tool, clear the diagnostic trouble codes from memory, and see if this code returns. If it does not, then the connections were most likely your problem.\nIf the code does return, we will need to test the sensor against a mechanical gauge. First turn the key off, then hook up the fuel pressure gauge. Next connect the scan tool and monitor fuel pressure on the scan tool. Turn the key on and note the pressure on the gauge versus what the scan tool reads. The scan tool and the gauge should be within 5 psi of each other. \nIf all tests have passed so far, and you continue to get a P0194 code, the last thing to check is the connections at the PCM. Pull the connectors apart and carefully inspect the terminals (the metal parts) inside the connectors. See if they look corroded, burnt or possibly green in color versus the normal metal color you are probably used to seeing. Wiggle all connections at the sensor, the PCM, and any other associated connector to check for looseness to find the cause for the intermittent condition.\nIf all tests have passed and you still get a code P0194, this would most likely indicate a failed PCM. A hard reset (battery disconnect) would be recommended before any PCM replacement could be justified. A FRP Sensor may have to be replaced as well.\n\n"}
{"P0195\n": "\n\nBegin by visually inspecting the engine oil temperature sensor and the corresponding wiring. Look for loose connections, damaged wiring, etc. If damage is found, repair as necessary, clear the code and see if it returns.\nNext, check for technical service bulletins (TSBs) regarding the issue. If nothing is found, you will need to move forward to step by step diagnosis of the system.\nThe following is a generalized procedure, as testing for this code varies between vehicles. To accurately test the system, you'll want to refer to the manufacture’s diagnostic flow chart. \n<h3> Check for proper cooling system operation</h3>\nCheck that the engine reaches and maintains a proper operating temperature. If the engine overheats or does not warm up as designed, there is a problem with the cooling system that should be addressed prior to any further testing. Cooling system DTCs being set along with an engine oil temperature sensor DTC, also indicate a potential problem with the cooling system.\n<h3> Do some preliminary circuit testing</h3>\nUse a scan tool to monitor the engine oil temperature sensor data parameter. Disconnect the EOT sensor; the scan tool value should drop to a very low value. Next, connect a jumper wire across the terminals. If the scan tool now displays a very high temperature, the connections are sound and the ECM can recognize the input. This means the problem is most like the sensor and not a circuit or PCM problem.\n<h3>Test the sensor</h3>\nDisconnect the engine oil temperature sensor connector. Next, measure the resistance between the two sensor terminals using a digital multimeter set to ohms. Start the engine and watch the meter value; the values should decrease smoothly as the engine warms up (check the engine temperature gauge on the dash to ensure the engine reaches operating temperature). If engine temperature increases but EOT resistance does not decrease, the sensor is faulty and should be replaced. Note: most manufactures have resistance/temperature charts in their service information to aid in the diagnostic process.\n<h3>Check the circuit</h3>\n\n Check the reference voltage side of the circuit: with the ignition on, use a digital multimeter set to volts to check for a 5-volt reference from the PCM at one of the two engine oil temperature sensor sensor terminals. If no reference signal is present, connect the meter set to ohms (with the ignition off) between the reference voltage pin on the EOT and the reference voltage pin on the PCM. If the meter reads out of limits (OL) there is an open circuit between the PCM and sensor that will need to be located and repaired. If the meter reads a numeric value, there is continuity. If everything is good up to this point, you'll want to check that there is 5-volts coming out of the PCM at the reference voltage terminal. If there is not a 5-volt reference from the PCM, the PCM is probably faulty.\nCheck the ground signal side of the circuit: connect the meter set to ohms (with the ignition off) between the ground terminal on the engine oil temperature sensor and the ground terminal on the PCM. If the meter reads out of limits (OL) there is an open circuit between the PCM and sensor that will need to be located and repaired. If the meter reads a numeric value, there is continuity. Finally, check that the PCM has a good ground by attaching one meter lead to the PCM ground terminal and the other to chassis ground. Once again, If the meter reads out of limits (OL) there is an open circuit between the PCM and ground that will need to be located and repaired.\n\n"}
{"P0196\n": "\nBegin by visually inspecting the engine oil temperature sensor and the corresponding wiring. Look for loose connections, damaged wiring, etc. If damage is found, repair as necessary, clear the code and see if it returns.\nNext, check for technical service bulletins (TSBs) regarding the issue. If nothing is found, you will need to move forward to step by step diagnosis of the system.\nThe following is a generalized procedure, as testing for this code varies between vehicles. To accurately test the system, you'll want to refer to the manufacture’s diagnostic flow chart. \n<h3> Check for proper cooling system operation</h3>\nCheck that the engine reaches and maintains a proper operating temperature. If the engine overheats or does not warm up as designed, there is a problem with the cooling system that should be addressed prior to any further testing. Cooling system DTCs being set along with an engine oil temperature sensor DTC, also indicate a potential problem with the cooling system.\n<h3> Do some preliminary circuit testing</h3>\nUse a scan tool to monitor the engine oil temperature sensor data parameter. Disconnect the EOT sensor; the scan tool value should drop to a very low value. Next, connect a jumper wire across the terminals. If the scan tool now displays a very high temperature, the connections are sound and the ECM can recognize the input. This means the problem is most like the sensor and not a circuit or PCM problem.\n<h3>Test the sensor</h3>\nDisconnect the engine oil temperature sensor connector. Next, measure the resistance between the two sensor terminals using a digital multimeter set to ohms. Start the engine and watch the meter value; the values should decrease smoothly as the engine warms up (check the engine temperature gauge on the dash to ensure the engine reaches operating temperature). If engine temperature increases but EOT resistance does not decrease, the sensor is faulty and should be replaced. Note: most manufactures have resistance/temperature charts in their service information to aid in the diagnostic process.\n<h3>Check the circuit</h3>\n\n Check the reference voltage side of the circuit: with the ignition on, use a digital multimeter set to volts to check for a 5-volt reference from the PCM at one of the two engine oil temperature sensor sensor terminals. If no reference signal is present, connect the meter set to ohms (with the ignition off) between the reference voltage pin on the EOT and the reference voltage pin on the PCM. If the meter reads out of limits (OL) there is an open circuit between the PCM and sensor that will need to be located and repaired. If the meter reads a numeric value, there is continuity. If everything is good up to this point, you'll want to check that there is 5-volts coming out of the PCM at the reference voltage terminal. If there is not a 5-volt reference from the PCM, the PCM is probably faulty.\nCheck the ground signal side of the circuit: connect the meter set to ohms (with the ignition off) between the ground terminal on the engine oil temperature sensor and the ground terminal on the PCM. If the meter reads out of limits (OL) there is an open circuit between the PCM and sensor that will need to be located and repaired. If the meter reads a numeric value, there is continuity. Finally, check that the PCM has a good ground by attaching one meter lead to the PCM ground terminal and the other to chassis ground. Once again, If the meter reads out of limits (OL) there is an open circuit between the PCM and ground that will need to be located and repaired.\n\n"}
{"P0197\n": "\nBegin by visually inspecting the engine oil temperature sensor and the corresponding wiring. Look for loose connections, damaged wiring, etc. If damage is found, repair as necessary, clear the code and see if it returns.\nNext, check for technical service bulletins (TSBs) regarding the issue. If nothing is found, you will need to move forward to step by step diagnosis of the system.\nThe following is a generalized procedure, as testing for this code varies between vehicles. To accurately test the system, you'll want to refer to the manufacture’s diagnostic flow chart. \nCheck for proper cooling system operation: Check that the engine reaches and maintains a proper operating temperature. If the engine overheats or does not warm up as designed, there is a problem with the cooling system that should be addressed prior to any further testing. Cooling system DTCs being set along with an engine oil temperature sensor DTC, also indicate a potential problem with the cooling system.\n\n Do some preliminary circuit testing: Use a scan tool to monitor the engine oil temperature sensor data parameter. Disconnect the EOT sensor; the scan tool value should drop to a very low value. Next, connect a jumper wire across the terminals. If the scan tool now displays a very high temperature, the connections are sound and the ECM can recognize the input. This means the problem is most like the sensor and not a circuit or PCM problem.\nTest the sensor: Disconnect the engine oil temperature sensor connector. Next, measure the resistance between the two sensor terminals using a digital multimeter set to ohms. Start the engine and watch the meter value; the values should decrease smoothly as the engine warms up (check the engine temperature gauge on the dash to ensure the engine reaches operating temperature). If engine temperature increases but EOT resistance does not decrease, the sensor is faulty and should be replaced. Note: most manufactures have resistance/temperature charts in their service information to aid in the diagnostic process.\nCheck the circuit:\n\n Check the reference voltage side of the circuit: with the ignition on, use a digital multimeter set to volts to check for a 5-volt reference from the PCM at one of the two engine oil temperature sensor sensor terminals. If no reference signal is present, connect the meter set to ohms (with the ignition off) between the reference voltage pin on the EOT and the reference voltage pin on the PCM. If the meter reads out of limits (OL) there is an open circuit between the PCM and sensor that will need to be located and repaired. If the meter reads a numeric value, there is continuity. If everything is good up to this point, you'll want to check that there is 5-volts coming out of the PCM at the reference voltage terminal. If there is not a 5-volt reference from the PCM, the PCM is probably faulty.\nCheck the ground signal side of the circuit: connect the meter set to ohms (with the ignition off) between the ground terminal on the engine oil temperature sensor and the ground terminal on the PCM. If the meter reads out of limits (OL) there is an open circuit between the PCM and sensor that will need to be located and repaired. If the meter reads a numeric value, there is continuity. Finally, check that the PCM has a good ground by attaching one meter lead to the PCM ground terminal and the other to chassis ground. Once again, If the meter reads out of limits (OL) there is an open circuit between the PCM and ground that will need to be located and repaired.\n\n"}
{"P0198\n": "\nBegin by visually inspecting the engine oil temperature sensor and the corresponding wiring. Look for loose connections, damaged wiring, etc. If damage is found, repair as necessary, clear the code and see if it returns.\nNext, check for technical service bulletins (TSBs) regarding the issue. If nothing is found, you will need to move forward to step by step diagnosis of the system.\nThe following is a generalized procedure, as testing for this code varies between vehicles. To accurately test the system, you'll want to refer to the manufacture’s diagnostic flow chart. \nCheck for proper cooling system operation: Check that the engine reaches and maintains a proper operating temperature. If the engine overheats or does not warm up as designed, there is a problem with the cooling system that should be addressed prior to any further testing. Cooling system DTCs being set along with an engine oil temperature sensor DTC, also indicate a potential problem with the cooling system.\n\n Do some preliminary circuit testing: Use a scan tool to monitor the engine oil temperature sensor data parameter. Disconnect the EOT sensor; the scan tool value should drop to a very low value. Next, connect a jumper wire across the terminals. If the scan tool now displays a very high temperature, the connections are sound and the ECM can recognize the input. This means the problem is most like the sensor and not a circuit or PCM problem.\nTest the sensor: Disconnect the engine oil temperature sensor connector. Next, measure the resistance between the two sensor terminals using a digital multimeter set to ohms. Start the engine and watch the meter value; the values should decrease smoothly as the engine warms up (check the engine temperature gauge on the dash to ensure the engine reaches operating temperature). If engine temperature increases but EOT resistance does not decrease, the sensor is faulty and should be replaced. Note: most manufactures have resistance/temperature charts in their service information to aid in the diagnostic process.\nCheck the circuit:\n\n Check the reference voltage side of the circuit: with the ignition on, use a digital multimeter set to volts to check for a 5-volt reference from the PCM at one of the two engine oil temperature sensor sensor terminals. If no reference signal is present, connect the meter set to ohms (with the ignition off) between the reference voltage pin on the EOT and the reference voltage pin on the PCM. If the meter reads out of limits (OL) there is an open circuit between the PCM and sensor that will need to be located and repaired. If the meter reads a numeric value, there is continuity. If everything is good up to this point, you'll want to check that there is 5-volts coming out of the PCM at the reference voltage terminal. If there is not a 5-volt reference from the PCM, the PCM is probably faulty.\nCheck the ground signal side of the circuit: connect the meter set to ohms (with the ignition off) between the ground terminal on the engine oil temperature sensor and the ground terminal on the PCM. If the meter reads out of limits (OL) there is an open circuit between the PCM and sensor that will need to be located and repaired. If the meter reads a numeric value, there is continuity. Finally, check that the PCM has a good ground by attaching one meter lead to the PCM ground terminal and the other to chassis ground. Once again, If the meter reads out of limits (OL) there is an open circuit between the PCM and ground that will need to be located and repaired. \n\n"}
{"P0199\n": "\nBegin by visually inspecting the engine oil temperature sensor and the corresponding wiring. Look for loose connections, damaged wiring, etc. If damage is found, repair as necessary, clear the code and see if it returns.\nNext, check for technical service bulletins (TSBs) regarding the issue. If nothing is found, you will need to move forward to step by step diagnosis of the system.\nThe following is a generalized procedure, as testing for this code varies between vehicles. To accurately test the system, you'll want to refer to the manufacture’s diagnostic flow chart. \nCheck for proper cooling system operation: Check that the engine reaches and maintains a proper operating temperature. If the engine overheats or does not warm up as designed, there is a problem with the cooling system that should be addressed prior to any further testing. Cooling system DTCs being set along with an engine oil temperature sensor DTC, also indicate a potential problem with the cooling system.\n\n Do some preliminary circuit testing: Use a scan tool to monitor the engine oil temperature sensor data parameter. Disconnect the EOT sensor; the scan tool value should drop to a very low value. Next, connect a jumper wire across the terminals. If the scan tool now displays a very high temperature, the connections are sound and the ECM can recognize the input. This means the problem is most like the sensor and not a circuit or PCM problem.\nTest the sensor: Disconnect the engine oil temperature sensor connector. Next, measure the resistance between the two sensor terminals using a digital multimeter set to ohms. Start the engine and watch the meter value; the values should decrease smoothly as the engine warms up (check the engine temperature gauge on the dash to ensure the engine reaches operating temperature). If engine temperature increases but EOT resistance does not decrease, the sensor is faulty and should be replaced. Note: most manufactures have resistance/temperature charts in their service information to aid in the diagnostic process.\nCheck the circuit:\n\n Check the reference voltage side of the circuit: with the ignition on, use a digital multimeter set to volts to check for a 5-volt reference from the PCM at one of the two engine oil temperature sensor sensor terminals. If no reference signal is present, connect the meter set to ohms (with the ignition off) between the reference voltage pin on the EOT and the reference voltage pin on the PCM. If the meter reads out of limits (OL) there is an open circuit between the PCM and sensor that will need to be located and repaired. If the meter reads a numeric value, there is continuity. If everything is good up to this point, you'll want to check that there is 5-volts coming out of the PCM at the reference voltage terminal. If there is not a 5-volt reference from the PCM, the PCM is probably faulty.\nCheck the ground signal side of the circuit: connect the meter set to ohms (with the ignition off) between the ground terminal on the engine oil temperature sensor and the ground terminal on the PCM. If the meter reads out of limits (OL) there is an open circuit between the PCM and sensor that will need to be located and repaired. If the meter reads a numeric value, there is continuity. Finally, check that the PCM has a good ground by attaching one meter lead to the PCM ground terminal and the other to chassis ground. Once again, If the meter reads out of limits (OL) there is an open circuit between the PCM and ground that will need to be located and repaired.\n\n"}
{"P0200\n": ""}

